{"产品设计/001【钱安川-敏捷需求分析和管理-用户故事方法】.md": "TOC1.需求从哪里来？需求的获取产品研发－市场部门谁是产品的用户产品的目标是什么产品的竞争对手分析投资回报分析产品用户角色建模和交互设计产品界面原型6868项目开发－客户谁是项目的用户项目的业务目标项目的投资回报分析客户当前的过程客户未来的过程6868需求文档驱动的过程不堪重负敏捷需求分析和管理过程!_v_images/20191129174335.png敏捷需求管理贯串项目始终：初始阶段C识别需求，仅供估算项目规模使用，“快速启动”；发布计划阶段C高风险的需求进行可行性分析6868迭代计划阶段需求细化6868迭代实施阶段反复验证需求并确认需求被实现6868每个迭代纳入新需求，重新审视需求列表及优先级，调整计划6868项目启动阶段目标和交付物项目愿景和动机62快速产出可以开始开发的需求列表粒度粗的MasterStory62确立可视化项目原型62了解技术风险62估算项目成本62制定发布和迭代计划（发布计划是动态的）62轻量的，可视的文档项目启动阶段交付物业务流程图架构原型（技术架构、平台）界面原型（PPT等）功能分解图（故事墙）!_v_images/20191129174346.png2.需求如何表述？用户故事卡片!_v_images/20191129174356.png用户故事的3C原则Card用户故事卡片本身代表了需求的存在Conversation用户故事所代表的一段对话和交流Confirmation用户故事的确定性用户故事XYZ表述X:用户角色作为。。。Y:目标系统提供的行为或功能我希望。。。Z:实现的业务价值或目标以便于。。。角色流程RoleProcess方法!_v_images/20191129174404.png1.作为用户，我希望能够通过书名和作者名查找书籍，以便我能快速的购买我想要的书2.作为用户，我希望能够把我感兴趣的书籍加入购物车，以便我能够批量购买3.作为用户，我希望能够查看我目前购物车内的书，以便我做出购买决定INVEST原则Independent可以独立开发Negotiable可以协商Valuable有价值Estimable大小可评估Sizedappropriately合适粒度Testable可测试验证3.需求的分解!_v_images/20191129174412.pngUserStory的逐步细化!_v_images/20191129174421.png非功能性需求Accessibility可用性Archiving归档Auditability可审计性Authentication安全认证Authorization授权Localization本地化6868验收条件AcceptanceCriteria如何验收用户故事？如何确定Story已经被开发完成？如何进行估算？验收条件具体属性功能性验收条件HappyPath/SadPath方法非功能性验收条件4.需求如何管理？用户故事生命周期!_v_images/20191129174433.png迭代过程中，分析师怎么做？!_v_images/20191129174441.png可视化需求管理来自于精益生产的看板管理KanbanManagementsystem目的是为了增强管理的透明性，鼓励每个人都去发现问题和解决问题，而不是等待别人来做!_v_images/20191129174448.pngMingle中的StoryWall!_v_images/20191129174457.png5.敏捷需求分析师必读《UserStoriesApplied:ForAgileSoftwareDevelopment》byMikeCohn《金字塔原理：思考、表达和解决问题的逻辑》（麦肯锡40年经典培训教材）", "产品设计/6C检测监测.md": "系统角色车间计划执行及缺陷处置员检测计划执行、缺陷整改反馈缺陷分析员数据处理适配器、缺陷识别缺陷审核员缺陷整改延期审批、缺陷销号方案编制及处置结果核实员缺陷整改方案、缺陷整改核实查询统计员查询与统计、设备查询统计数据综合分析员数据综合分析基础信息管理员设备信息管理系统管理员系统管理供电段计划编制员检测计划编制计划审核员检测计划签收计划执行及缺陷处置员检测计划执行、缺陷整改反馈缺陷分析员Ftp上传客户端、数据处理适配器、缺陷识别、超限实时报警、缺陷审核员缺陷整改通知、缺陷整改延期审批、缺陷销号方案编制及处置结果核实员缺陷整改方案、缺陷整改核实查询统计员查询与统计、设备查询统计数据综合分析员数据综合分析基础信息管理员设备信息管理系统管理员系统管理铁路局级系统计划编制员转发1C检测计划、4C检测计划管理查询统计员查询与统计、设备查询统计数据综合分析员数据综合分析系统管理员系统管理总公司级系统计划编制员1C检测计划查询统计员查询与统计、设备查询统计数据综合分析员数据综合分析系统管理员系统管理", "产品设计/ERP集团管理套件.md": "!_v_images/20191120204933.png", "产品设计/GM系统集成资质申报.md": "高铁供电智慧运营管理云平台研发背景2014年广州、昆明等供电段提出建设统合段内众多部门综合信息化解决方案的要求，同时铁总的十三五规划也针对信息的整合提出要求。而现实的行业现状是快速扩充运输能力需要安全保障，如何保证如此高速、高密度、高复杂性的路网的运输与运营安全变得非常重要；铁路行业装备数量和水平迅速提高使得提高资产的利用率、降本增效势在必行；铁路行业缺乏企业化的运营，如何提高铁路运营效率，挖掘运输潜力，实现现代化的铁路运营管理也是十分急迫。这都反映出铁路供电行业对全行业业务整合的要求日渐强烈，用户对应用系统的业务集成、数据整合、性能等方面要求更高，常规的垂直应用架构已无法应对，分布式服务架构以及流动计算架构势在必行，亟需一个治理系统确保架构有条不紊的演进。简介按照公司领导的要求和设计理念，于2015年研发部开始调研及设计满足行业需求的信息化平台。和公司领导研讨决定，我们要打造“标准化、流程化、协同化、移动化”的综合管理信息平台――“四化平台”，在供电信息化行业形成“二个中心”――数据中心、业务中心。“四化平台”将以平台化建设基础、以流程整合为纽带、以生产运营为核心、以移动应用和门户整合为手段来建设，建立供电行业的数据存储、处理、分析利用的中心和各部门业务整合业务处理中心，改变数据不统一和数据孤岛现状，改变各部门业务孤立，系统众多的现状。主要功能DIP平台是光芒公司对铁路供电业务的深入调研，收集铁路总公司、路局以及供电段的多方需求，为支撑铁路供电业务的持续快速发展，提供一体化、全方位的信息化技术解决方案。DIP平台基于插件思想和SOA思想建设，提供应用集成、统一认证及授权、分布式流程管理器、服务容器、数据交换以及基础应用开发框架中间件等。总体结构如下图：!_v_images/20191120211915.png实现光芒自己的应用开发框架。Framework提供了全栈的开发支持，它包括高效ORM、基于扁平化的UI组件库、Web框架、代码生成工具等。Framework做到了轻量级，便于扩展，简单的编程模型，便于使用。ORM提供了一个通用的Dao层，简化数据库访问操作，使得业务代码编写集中在Service层，简化了编程模型。扁平化的UI组件库采用的是流行的扁平化的风格，方便使用，提高开发效率，提供了漂亮的界面设计。代码生成工具提供了生成单表的CRUD的代码，减少部分编码工作。实现基于插件思想的应用集成容器。插件容器是用于集成其他应用子系统和第三方系统。对应用插件子系统的集成提供完整的集成机制，同时应用插件子系统需要遵循插件容器的接入准则和规范，插件容器应用子系统提供统一认证及授权服务、分布式的流程管理支持、统一的门户界面集成等。基于插件思想的插件容器有以下优势：第一、将复杂的大系统切分成独立的插件子系统，独立开发、独立部署，降低复杂度，提高访问性能。第二、是各个子系统关注业务本身，而不用关注权限控制、流程管理、门户主界面等功能。插件的架构图如下：!_v_images/20191120211938.png实现了统一认证及授权。统一认证与授权为各个基于平台的子系统提供人员、组织、功能权限与数据权限管理，各子系统功能基于无状态来实现。它减轻了开发人员开发项目的工作量及时间，并且保证了权限系统的一致性，为供电段众多分散的子系统整合提供了整合基础。其架构图如下：!_v_images/20191120211952.png实现了分布式流程管理器。分布式流程管理器提供独立于应用的流程管理，它以服务的方式提供流程引擎的功能，可分布式部署，应用系统采用服务调用的方式管理流程。我们还开发了轻量级的流程设计器，支持常用浏览器,支持常用的流程控制节点，支持自动调用节点等。市面上多是嵌入式的流程引擎，独立的流程引擎只有大公司才有，它为复杂的企业化业务集成提供了整合支持。其架构图如下：!_v_images/20191120212056.png实现了服务容器。服务容器提供服务的注册（自动发现）、服务路由、服务的管理、服务运行监控等功能。服务容器思想来源于SOA架构的企业服务总线（即ESB），但比一般的ESB要轻量很多，它可分布式部署，支持负载均衡，为高并发提高了基础。除此之外，服务容器还提高了方便的分布式调用框架，便于和业务系统集成。服务容器是DIP平台的核心之一，它是SOA思想的体现，它将业务功能服务化，提供了业务功能级别的复用，降低业务系统的复杂度，便于系统的扩展与升级。其架构图如下：!_v_images/20191120212113.png实现了自定义流程中间件。自定义流程中间件提供简单业务流程的审批功能，用户可以根据自己的需要定义审批流程，并可以设置每一步的审批内容，可以提交每一步的审批意见。自定义流程中间件能简化一部分业务功能的开发，提高业务的开发效率。实现了扁平化UI组件库。UI组件库采用扁平化的设计规范，UI的组件外观设计非常清新和漂亮，兼顾组件的易用性，提供了界面上要用到的几乎所有组件。采用此UI组件库能非常容易的开发出精美的页面，且易于学习，极大的提高了页面的开发效率。实现了智能表单。智能表单是通过工具的配置，在不编写代码的情况下，读取数据库表的结构，生成数据库表与实体的映射关系、页面及后台代码，完成单表或多表的简单的操作功能。使用智能表单能极大的提高开发效率，降低开发成本，缩短开发周期，促使软件的尽快交付。实现了API网关。API网关主要用处是将外部请求反向路由到内部具体的服务上，屏蔽后台服务的复杂性，除此之外它还提供了API接口的安全认证和防爬虫、限流和容错功能、接口监控和日志等功能。API网关能为移动APP应用及第三方应用提供接口支持。技术特点平台采用基于SOA体系架构。是为了解决在网络环境下业务集成的需要，通过连接能完成特定任务的独立功能实体实现的一种软件系统架构。SOA是一个组件模型，它将应用程序的不同功能单元（称为服务）通过这些服务之间定义良好的接口和契约联系起来。在本平台中，所有服务单元均遵循SOA设计方法，并通过服务组合完成一个具体的数据同步任务。平台使用简单。平台的开发模型足够简洁，各模块间是松耦合。平台的简单化保证了开发者和使用者在短时间内能够掌握，并且可以灵活扩展，降低调试难度，提供开发速度。此外，平台开发必须使用最常用的技术，各种封装接口必须简洁且丰富，并为封装的接口提供单元测试，使用者可以参照使用。平台的组件化设计。平台采用分层设计，各层中的功能设计遵循组件化的原则。保证各功能组件内部高内聚，外部松耦合，明确定义组件内部和外部的依赖关系，明确定义组件之间交互接口。并提供方便的组件组合机制，按需取用，保证各业务组件之间可以自由的组合使用。平台的扩展性。平台应能接入整合其他异构或同构的系统。平台提供统一的认证、功能整合、数据整合的机制，接入既有的系统。基于平台新开发的系统，遵循平台的接口规范，平台可以方便的部署和卸载这些系统。实时数据采集和数据交换中心研发背景简介数据交换平台是一个在异构的系统之间高速交换数据的工具，实现了在任意的内部系统、外部系统之间的数据交换。内部系统之间的数据交换包括：数据库数据交换、缓存数据交换、消息队列的数据交换、RPC服务数据交换已经文件系统文件交换。外部数据交换是通过接口的方式来进行交换，可支持多种数据协议格式。数据交换平台的结构图如下：!_v_images/20191120212151.png主要功能技术特点（1）高度灵活性：灵活的系统架构可以快速有效地响应业务逻辑的变化，操作人员可以通过修改系统配置来满足来自系统内部和外部的需求变化。（2）可维护性：以最小的代价满足业务的变化，系统使用了以下方法：系统基础结构和应用服务的分离；自成体系的独立的业务组件；数据，数据访问对象和业务对象的分离。（3）优化性能：系统设计时，根据各种技术的不同特点进行筛选以提高性能。例如PL/SQL被用来处理高容量的批处理工作，使用当代主流软/硬件技术如集群和负载平衡来确保稳定性。（4）系统安全性：针对各环节，采取必要的权限和内控机制，防范安全漏洞。统计分析的各项数据信息的准确性、安全性要求很高。为了保证系统的安全可靠，整个系统采用各种软硬件技术将系统核心的信息与用户操作界面进行有机的隔离和授权访问，达到有权者畅通无阻、无权者寸步难行的效果。（5）数据的准确性：监控系统内数据流，保证数据在各环节的一致。保证系统数据的准确性，一方面，在数据库设计层面，我们考虑使用数据的约束控制，如主、外键，另外，在数据之间的关系层面上，我们提供了必要的检测程序，再者，在流程实现层面，保证事务的一致性，即只有整个事务全面成功后才能提交整个事务等等。1、SOA：面向服务的体系结构（ServiceOrientedArchitecture，SOA）是为了解决在Internet环境下业务集成的需要，通过连接能完成特定任务的独立功能实体实现的一种软件系统架构。SOA是一个组件模型，它将应用程序的不同功能单元（称为服务）通过这些服务之间定义良好的接口和契约联系起来。在本平台中，所有服务单元均遵循SOA设计方法，并通过服务组合完成一个具体的数据同步任务。2、支持同构和异构数据交换：平台允许数据交换的双方是异构和同构的。所谓同构是指源和目标系统之间是完全相同的，数据库表结构也是相同的；若为异构是指源和目标系统之间存在一定的差异性，数据库表结构也可能是不相同。3、支持全量同步：平台能实现针对数据源的全量同步，将源系统指定表中的数据一次性全部同步到目标系统；4、支持增量同步：平台会将源系统指定数据库表中所增加的数据，按照一定时间规则逐次同步到目标业务系统；5、支持复制方式同步：平台支持将源系统中的数据以全量或者增量的方式复制到目标业务系统，源系统中的数据保持不变；6、支持迁移方式同步：平台支持将源系统中的数据以全量或者增量的方式迁移到目标业务系统，但迁移成功后，源系统中的相应数据会被全部删除。这点是迁移方式和复制方式同步所存在的最根本性区别；7、同步报文规范：将同步业务功能统一制定成标准XML业务规范。规范主要由元数据和业务报文等两方面组成。元数据称为数据单元，是通过定义、标识、表示以及允许值等一系列属性描述的数据单元，在特定的语义环境中被认为是不可再分的最小数据单元。业务报文则是根据具体同步业务需求对数据元进行有机组合，从而形成一个具有特定业务含义的集合。8、内容过滤：本平台支持对交换的数据进行内容过滤，确保只有满足一定条件的数据才能够成功同步到目标系统。9、格式转换：当源和目标系统的数据库结构存在差异时，系统提供的格式转换功能会对表字段和内容进行转换。10、支持多种数据库：本平台目前主要支持主流的几种数据库，如Oracle、MySql、SqlServer等，其他数据库正在测试中；11、支持大字段类型交换：本平台支持对大字段型的数据表进行同步，如blob、clob等类型。12、同步交易记录：对平台处理的同步交易进行记录。平台将记录交易的处理时间、处理状态、报文内容等信息，为交易跟踪和分析统计提供数据依据；13、支持国际化：本平台支持语言国际化，目前已经有中文和英文两个版本；数据中心应用模式满足纵向和横向各部门之间的不同管理关系需求，支持集中和分级管理模式，实现“一个平台管理服务中心、多领域业务中心、部门节点”三层管理结构应用需求。平台提供多种部门节点数据和应用接入方式，即可采用前置机接入方式，亦可采用应用直接接入方式。平台提供一体化的应用桥接功能，无需单独部署部门独立的“桥接系统”，大大降低应用系统接入平台“最后一公里”的难度和成本。高灵活性和扩展性。平台采用了面向服务的架构SOA服务技术，由松藕合、图形化可配置的接口和数据处理服务组件构成的交换服务流程可灵活动态地改变，并适应节点应用系统不断升级改造和数据结构常变化的现实需求。支持多种数据传输方式（包括TCP、Http、MQ等），并结合不同传输方式的特点，充分利用不通传输方式的优势，提供可靠、健壮的传输实现。安全可靠的数据交换服务。平台提供安全可靠的数据传输能力，保证数据的完整性、一致性，使传输的数据不丢失、不重复，次序不乱，传且只传一次，并具备跨越多个网络环境，穿透多重防火墙的能力；除了采用一般的数据加密传输技术外，并采用SSL/TLS协议实现安全连接与传输，可与第三方认证授信机构进行数字证书的签发。数据交换平台功能结构图如下：!_v_images/20191120212220.png数据采集平台。数据采集平台作为数据中心信息来源，主要任务是对来自不同部门，不同类型的数据进行收集。数据采集平台提供统一的数据采集方式，方便不后台数据集成、数据存储平台信息通信。可以定义标准的数据采集模板，支持随时随地采集（在线、离线），支持标准的采集数据存储方式。在这种架构下，可以直接调用数据库接口倒入数据，也可以通过调用WebService向数据集成平台发请求。数据交换中心。数据交换中心实现数据中心的数据采集与分发，提供对被交换信息进行打包、解包、过滤、审核、装载入库等数据交换服务接口。一方面它负责从各分系统中提取采集来的数据，将其导入到数据中心中；另一方面，它负责将数据中心共享库中的数据根据分系统的需要，分发到它们的系统数据库中。数据交换中心实现了数据中心平台不各业务系统之间的数据交换、各业务部门各业务系统之间的统一信息交换，为各部门协同工作、协同办公、各种业务系统之间的业务整合提供支撑平台。数据交换中心在交换平台中，起到数据统一交换的作用：各应用发送到中心的数据，由交换中心根据预先配置的交换规则交换到目标系统中，传输内容可精确定制，包括全表和增量数据。数据交换适配器。数据交换适配器通过系统管理、数据压缩、加密、数据交换、路由解析、断点续传等技术保证各系统之间安全、准确的数据交换。一方面，数据交换适配器将采集中的数据提交给数据中心；另一方面，各业务系统通过它接收从数据中心分发过来的数据，进行转换，并存入相应的共享库中。适配器工作在应用系统端，负责该系统与其他应用系统的数据交换，支持实时、定时、状态触发等各种数据采集方式；支持多种数据源的数据采集，包括Oracle、DB2、SQLServer、Dbf、Access、Excel、TXT、XML、大对象数据、文件等多种形式，可定制开发特殊数据源。统一配置管理。统一配置管理包括交换基础信息配置和交换业务配置。交换基础信息配置是指交换节点、交换通道及网络拓扑配置。交换业务配置指所有的交换业务、交换规则、交换路径都在这里进行配置及管理。统一配置实现图形化的配置管理，实现交换流程设计，简捷的鼠标拖拽操作方式，交换流程的设计支持一对一、一对多、多对一、多对多等多种数据交换方式。统一监控管理。统一监控管理包括交换环境监控和交换业务数据监控。交换环境的监控主要是指各个交换节点以及整个交换网络的监控，通过之前在配置管理中配置好的一个交换网络拓扑图可以很清晰的监控到整个交换网络及网络中各交换节点的状态是否正常；当发现交换节点有异常的显示后，可以查看此交换节点详细的监控，包括交换服务器资源占用情况、交换服务器上各交换流程的运行情况等信息。交换业务数据监控指在数据交换中，用户最关心的是数据是否正确、完整的交换到指定的目的地，现有数据平台从多个角度去完成了数据交换的监控及告警。安全保障。在与业务无关的通讯中间件基础上，数据传输支持常用的多种加密技术，保证数据传输过程的安全，在数据传输过程中，提供数据缓冲和发送校验等多种技术保障，保证数据传输完整性。交大光芒GMPMOS铁路供电维修与运营管理系统软件基础业务软件平台：是以业务为导向和驱动的、可快速构建应用软件的软件平台。包括集成应用平台、开发体系。编写要点：侧重业务和应用功能，体现开发模式，强调在此之上可快速构建何类子系统或子功能等。内容还可细化：如数据库支持何种数据库，操作系统兼容何种操作系统，数据总线采用何种协议等。简介GMRPSMOS铁路供电维修与运营管理系统是针对铁路供电设备（尤其是接触网相关设备）的维修及运营而建立的资产管理与作业管理相结合的综合管理信息化系统，对铁路供电设备（尤其是接触网相关设备）进行全生命周期的资产设备管理，对铁路供电运营维修/检修作业进行通过作业计划系统进行合理有效调控；功能概述（参考【铁一院《铁路供电运营维护管理信息化方案研究报告20160307a》】）设备建模管理设备建模管理是整个设备管理的核心功能，利用设备实施源头的设计信息、厂家信息及采集信息，通过对所有供电专业设备及零部件的数据信息模型构建，能够非常方便的进行设备的动态及静态信息管理，从而实现对设备及零部件的全生命周期进行跟踪和维护，形成生态发展模式，推动设备管理由定期管理向寿命管理的转变。设备管理设备管理是针对接触网、变电及电力等专业中涉及到的公用性质数据信息的管理和维护，包括对铁路线别、站场区间、牵引变电所、电力变配电所、接触网、电力线路等信息。基础数据作为设备管理的基石，是构建完整设备数据信息不可分割的重要组成部分，也是实现设备级运行、检修、跟踪和维护的基础。计划管理计划管理是对接触网、变电及电力等专业设备在运行、检测及检修等活动时需要编制的计划信息进行维护管理，包括年、月、周、日及临时计划等。通过将相关的设备信息编入计划中，实现设备级的计划管理模式，从而帮助用户真正合理地制定出符合铁路供电信息化修程修制的设备管理模式，避免漏检漏修等问题的出现。作业管理作业管理包括日常巡视、工作票、检测检修过程等信息的管理，是整个检测检修过程的记录和维护。作业管理涉及到整个作业过程信息的收集和维护管理，包括作业前的出工准备、材料及工具准备、人员准备、作业过程安全卡控、作业完成及收工等信息。根据计划进行作业派工，包括工作票的填写、上报、审核，以及派工单、作业过程的登记、审核等操作，可以自动更新设备的状态，导出作业票、派工单等数据。设备缺陷管理对来自日常巡视、作业过程中发现的电化缺陷信息进行管理，缺陷来源多种多样，如：SCADA、6C等。作业规范管理作业规范是指在作业执行前和执行中的相关信息的配置，包括作业检测项、作业工具、作业材料，以及执行过程中的安全措施和规范信息等。知识库管理知识库中包括各种规章制度以及颁布的规范，还有所辖地区的文档设计资料和运维过程中记录和生成的经验案例。技术特点设备模型化抽象设备信息、建立设备全生命周期模型，将设备模型信息接入设备运营维护管理之中，形成从项目设计阶段到施工阶段直至运营维护管理阶段全过程的具有“一模多用”的全生命周期特性的设备信息库。设备建模技术有助于运维管理的设备信息编码统一，减少后期信息重复录入，提高信息精准度；有助于设计、施工和运维之间的信息互联互通，有助于运维单位在管理过程中全面、快捷地掌握设计及施工信息，减少故障分析所消耗的时间，提高运维管理水平；有助于运维管理指导设计、施工，实现工程预介入，减少运维成本，提高运维协作能力。功能模块化模块化设计需要模块本身具有通用性，且模块之间相对独立、并通过接口进行交互。本系统中各个模块的设计充分考虑了通用性，可以根据不同的业务需求选用不同的模块；而各模块又是非常独立的，所以方便了各个功能模块的开发与调试。模块化优点有：第一、模块的通用性使得模块可以更广泛的复用，大量利用已有的经过测试和使用的模块，可以降低产品研发的风险，提高产品的可靠性和质量；第二、使用经过实践验证的模块可以大大缩短研发周期，从而加快产品研发进度；第三、采用成熟的经过验证的模块，可以大大降低研发成本；第四、相对独立的模块划分，有利于企业研发团队分工，规范不同团队间的信息接口，进行更为深入的专业化研究和不同模块系统的并行开发。流程可定制在对各个供电段业务流程进行梳理后，我们形成一套相对标准的工作流程，并采用专业的流程引擎来管理流程，使得业务流程可以定制化。流程定制化兼顾各个供电段业务流程的差异性，能在较短的时间内通过流程的配置完成业务流程开发。通过在作业过程中引入智能终端和相关专业App的使用，帮助作业人员提高作业效率和规范作业过程，并为监控人员提供实时的作业信息和事后作业过程的回溯，从而为不断优化作业执行过程及效率提供了基础数据信息，实现作业流程可追溯，运维闭环管理。GIS可视化展示通过GIS地理信息系统实现对铁路沿线供电设备及周边地理信息的有效掌握，结合“一杆一档”、“一台一档”、设计图纸信息、设备信息、设备缺陷、天窗信息和巡检记录等数据库，在卫星地图中实现设备精准定位、联动设备基础信息，并可对巡检过程中的路线记录和设备遗漏进行集中反映。移动化办公支持提供对移动App支持，有以下优点：1）无论是车间或工区，不再需要电脑才能办公作业，只需通过移动App就可以完成作业工作。2）无论工作人员在哪儿，都可以及时处理自己相关的工作，可以提高工作的效率。3）加强了远程协作，通过移动App在远程提供业务支持。4）可以很方便对一些突发性事件的处理、应急性事件的部署。图形化展示本系统采用可视化技术，利用计算机图形学和图像处理技术,将将海量数据信息以直观、生动、高效地展示给相关操作使用人员的相关实现数据转换为图形或图像在屏幕上显示出来,并进行交互处理。多种数据库、多种操作系统支持本系统采用业界流程的开发技术，保证了系统对多种数据库（如：Oracle、SQLServer等）的支持，可以在各种不同的数据源之间平滑切换；同时系统基于Java技术体系，可以在各种流行的操作系统上运行，兼顾运行环境的多样性。架构!_v_images/20191120212323.png本系统架构如上图所示，系统建立在光芒公司信息化基础平台之上，提供多种操作系统、多种数据库的支持；系统充分考虑基础组件的通用性，将流程配置、设备建模、图形化展示、GIS可视化作为独立于业务的基础组件来构建，并在此基础上，建立整个系统的业务框架，并将各个业务模块建立在此业务框架之上，确保了核心业务模块的建设遵循模块化的原则。系统的核心业务有：计划管理、作业管理、缺陷管理、设备管理、设备履历管理、台帐管理、知识库、作业规范管理、查询统计等。系统提供两种用户界面：传统Web方式和移动App的方式。", "产品设计/中科软应急指挥系统解决方案.md": "一、概述中科软应急指挥系统解决方案是一个充分利用现代网络技术、计算机技术和多媒体技术，以**资源数据库、方法库和知识库为基础，以地理信息系统、数据分析系统、信息表示系统**为手段，实现对**突发事件数据的收集、分析、对应急指挥的辅助决策、对应急资源的组织、协调和管理控制**等指挥功能。该系统在面对突发事件时，能够为指挥首长和参与指挥的业务人员和专家，提供各种通讯和信息服务，提供决策依据和分析手段以及指挥命令实施部署和监督方法，能及时、有效地调集各种资源，实施灾情控制和医疗救治工作，减轻突发事件对居民健康和生命安全造成威胁，用最有效的控制手段和小的资源投入，将损失控制在最小范围内。!_v_images/20191120213013.png**方案实现目标**在数据采集和信息处理方面，实现突发事件信息的采集、传输、存储、处理、分析、预案确定及启动全过程的信息化、自动化和网络化。在预警方面，建立分布式可逐级监测和处理突发事件信息管理网络，实现对突发事件的评估与预警触发启动；在会商方面，利用视频接收设备、通讯系统、数据库系统、地理信息系统等设施，为指挥首长、业务人员和专家提供大屏幕显示和信息服务，随时为首长决策提供各种有效而生动的辅助决策信息；在决策支持方面，形成一套具有实时监测、科学预测、及时有效发布和动态反馈评估等功能的辅助决策系统，实现对突发事件应急处理的决策支持。在资源调度方面，通过系统对应急资源的科学调度，充分保证对特定突发事件应急处理所需资源的配置。在公众信息发布方面，能及时向社会公众发布紧急救助信息服务和善后处理工作信息。**方案特色**中科软在监测、预警和应急领域提供“监测、预警、应急”一体化的应急决策指挥解决方案，实现系统“平战结合”的建设思想。基于我们丰富的监测系统设计经验，我们提供一套快速的监测系统开发和部署框架；以多样化、可扩展的可靠信息渠道解决应急指挥中必须的信息来源问题；基于数据仓库和数据挖掘技术，提供多类行业的数据分析和预警模型，实现监测与预警联动；融合门户技术和关键指标仪表盘设计技术，结合系统中丰富的系统分析模块，实现各种业务数据的显示界面集成，便于决策者快速、直观地了解信息、把握全局；以业界主流和开放的技术标准和设计模式，提供开放的、平台级的应用编程接口和管理工具，既满足各级政府部门快速拓展和实施系统，又便于保护投资，使系统长期健康发展。二、总体框架应急决策指挥系统涉及领域广，技术层次深，系统的构架也是比较复杂，总体来讲，其框架图如下：!_v_images/20191120213026.png根据北京市《应急指挥系统信息化技术支撑体系》，北京市的应急系统能够体系结构细化为下图：!_v_images/20191120213041.png中科软依据据北京市的总体框架，结合中科软多年应急系统的经验，进一步细化应用框架到可实施框架，从下向上依次是**基础设施层、数据中心层、资源整合层、应用支撑层、应用层、综合门户**，并有安全保障体系和运行维护与支持体系保障系统的正常运行。如下图所示：!_v_images/20191120213052.png基础设施层：整个系统的底层是信息系统的基础设施，这包括网络及通讯设施、主机服务器及存储系统、视频会议系统、大屏幕数据演示系统，以及操作系统、数据库管理系统及网络通讯基础设施等，这些是系统最基本的运行基础。数据中心：数据是整个系统的基础，基础数据经过采集、处理、标准化、传输、存储，形成系统资源库，为系统提供了高效的业务分析、决策、交换、共享的数据环境。主要包括以下数据库：模型数据库知识数据库方法数据库预案数据库人口基础数据库灾情数据库地理信息空间数据库基础字典数据库资源数据库资源整合层：应急指挥需要多部门、多系统联动配合，如果彼此孤立，不能实现信息共享，就会形成的“信息孤岛”。造成缺乏可比数据、缺乏分析、缺乏管理。难以获得全面的业务信息，就会影响业务和决策的效率和准确性。通过提供应用整合服务、业务整合服务、数据整合服务连接相关职能部门的系统、业务、数据，最大程度的解决信息孤岛，最大限度地利用现有的数据资源。应用支撑层：应用支撑层的设计直接影响系统的稳定性、安全性及可靠性等重要因素，中科软凭借多年的软件开发经验，采用低耦合，高内聚的设计思想，基于开放的标准在该层部署应用部件，为系统高效、可靠的运行提供保障。包括：决策支持系统业务支持系统GIS引擎工作流引擎全文检索消息中间件信息推送内容管理用户管理权限管理通用数据接口应用层中科软应急决策系统根据突发事件应急的特点，综合各种数据信息及处理软件，缺省提供了辅助会商决策系统、数据收集与管理系统、信息处理与分析系统、资源管理系统、信息发布系统等应用系统，并可根据需要，快速的扩展业务系统。综合门户综合门户系统建立了一个灵活、规范的信息组织管理平台和全网范围的网络协作环境，实现集成的信息采集、内容管理、信息搜索，能够直接组织各类共享信息和内部业务基础信息，面向不同使用对象，通过门户技术实现个性化服务，从而实现初步的信息整合；门户不同的用户提供个性化、服务，实现用户的统一认证、统一管理，提供实时信息访问及多系统协同工作。三、基础平台解决方案应急基础平台是基于先进信息技术、网络技术、GIS技术、通信技术和应急信息资源基础上的，充分利用现有资源，依托政府系统电子政务建设，建立统一应急指挥网络平台，实现紧急事件报警的统一接入与交换。根据突发公共事件突发性、区域性、持续性等特点，以及应急组织指挥机构及其职责、工作流程、应急响应、处置步骤、处置方案等应急业务的集成，应急指挥系统基础平台建设主要包括以下几个方面。1.音视频系统；2.会议系统；3.通信系统；4.后勤保障系统!_v_images/20191120213117.png音视频系统：音视频系统贯穿在整个应急指挥中心的日常工作、应急受理、指挥调度、管理系统等等各种活动中，是应急指挥系统最有效的信息获取、协调指挥的手段之一；是应急指挥系统与指挥人员人机交互的最主要的表现形式。包括但不限于下列子系统：音视频整合系统（将各种不同格式的音像信号整合后接入指挥中心）大屏幕显示系统远程视频监控视频点播系统综合指挥席会议系统：会议系统是应急指挥系统对于突发公共事件进行协调处理、信息分析、决策以及指令下达的重要工具，实现各级指挥部门直接交流，成为应急指挥系统最有效的信息获取，协调指挥的手段之一。包括但不限于下列子系统：数字会议系统电话会议系统视频会议系统通信系统通信系统是完成日常应急值守和确保各类突发公共事件处置的重要技术保障平台，是应急指挥系统协调指挥的主要途径。应急指挥中心的通信系统即要覆盖多个下级专项指挥部，同时又要保障与上级应急指挥中心的通信，实现在紧急状况下调度指挥和协调管理。包括但不限于下列子系统：有线通信系统无线通信系统后勤保障系统后勤保障系统的作用是确保应急指挥平台各种设备的可靠运行，确保各种应急数据的传输、存储及灾备，并为指挥中心内部人员提供安全和舒适的工作环境。包括但不限于下列子系统：机房建设（包括机房装修、配电、空调等）综合布线系统计算机网络系统数据存储系统异地灾备系统音、视频存储系统中央控制系统安防系统（含监控和门禁系统）不间断电源系统四、软件解决方案!_v_images/20191120213137.png突发事件监测功能突发公共事件的发生具有分散性、隐蔽性、积聚性和突发性的特点，因此根据这些特点建立了事件监测的机制，能从日常管理的系统数据中、日常管理作业流程中、各种监测数据及其他相关的应用系统通过数据的抽取发现突发公共事件隐患的功能，并利用各种数据挖掘工具，进行突发公共事件信息的挖掘分析，做到突发事件及早发现、消灭，提前预防、及时处理。突发事件预警功能根据坚持预防为主的原则，突发公共事件应急系统需要根据不同专业特点建立各种突发公共事件预测预警模型，日常管理系统不断为模型输入参数，一旦模型计算结果出现异常情况时，系统必须能够通过预先设定的途径进行报警，并自动通过电话、传真、Email、短信等方式提醒突发公共事件相关人员。事件信息上报处理本系统能够根据不同专业的突发事件的管理模式及报告制度，设定该专业的突发事件的报送流程。突发公共事件一旦发生，系统必须能够自动地根据已经配置好的报送流程，根据事件等级的不同，直接报送到不同的直报机构，同时，根据不同的事件等级将信息报送或抄送不同的应急指挥中心。资源管理与调度突发公共事件应急指挥部根据突发公共事件等级和预案对所涉应急资源集中管理和统一调度。由于各个专业应急指挥部涉及的不同专业的应急资源具有不同的调度权限，应急资源的调度指令的下达根据调度权限逐级下达。应急资源的现场调度情况，通过系统直接反馈到应急指挥部，指挥部根据现场情况及时进行预案的调整。并且系统具备应急资源分配功能，能够设置本专业应急资源的空间分布、资源属性以及分配和调度方式。内容管理与信息发布系统能及时向系统内用户发布专业信息，提供专业应急信息的服务功能；并能及时向公众发布事件发展情况、紧急救助信息服务和善后处理工作信息。在目录集成的基础上，实现了综合信息门户与外部网站的集成，能够对访问用户进行统一管理，同时根据安全权限开放信息，提供信息查询与浏览功能。在发布方式上，支持空间信息的Web发布。恢复重建管理灾情信息录入功能除了通过灾情数据采集模块及数据整合模块获得基础数据外，通过该功能能够对灾情信息进行补充（包括文字信息、数据信息、图片信息、录象信息、空间位置信息等），便于系统进行灾情分析，建立重建方案。灾情分布分析功能能够将各种灾情以空间信息为基础进行灾情分布分析，以地理信息系统为依托，显示各类灾情分布图。灾后清理功能辅助管理灾后清理工作，计算清理的工作量，专业人员，所需资源。并能调度各种灾后清理资源。恢复重建模型分析功能能够为不同专业的突发事件建立恢复重建的分析模型，评估模型。利用突发公共事件分析模型，系统对突发公共事件的危害进行分析，为恢复重建提供建设建议方案供选择。通过评估模型对各种重建方案作出评估，以便确定最优的恢复重建方案。平时信息管理系统平时管理功能是为满足应急指挥中心在非应急状态下的日常工作需要而实现的。通过对国内外灾害事件汇总分析、预警准备、突发事件管理、综合查询、预案管理、知识库管理、方法库管理、情报管理、日常办公、外事管理等功能的执行管理，达到预测、预防突发公共事件的目的。模拟培训功能系统应提供仿真演习的功能，能通过仿真演习对应急队伍进行培训和演练。系统能够通过统一的综合门户系统和外网门户，建立各个专业应急教育培训栏目，为应急指挥工作人员加强专业技能培训，广大的民众提供应对突发公共事件的基础知识。通过培训教育，提高工作人员指挥分析能力，提供广大民众应对突发公共事件的应对能力。数据交换与共享交换与共享系统是各类应用系统业务信息统一的数据交换和信息共享的平台，是多个应用系统实现信息整和的重要手段。数据交换系统采用多种模式与现有的系统有机集成，是信息系统统一中最为基础的部分，其建设目标是：提供一个标准的、可靠的数据交换系统，为各个应用系统提供数据交换的公共模块；简化、规范各个应用系统的开发；统一管理数据的流量监控，数据加密压缩处理等，使网络利用更高效；为各个应用系统之间、异构数据库之间、不同的网络系统之间的信息提供整和的手段；为内部系统与外部系统提供统一的、安全的、可靠的连接手段。地理信息（GIS）系统GIS应用划分成基于C/S结构的应用和基于B/S结构的应用两种。前一种结构适用于实现数据的采集、入库、编辑和复杂的空间分析、专题制图等应用，主要是面向数据维护人员和专业分析人员使用的，以及为领导和专家提供辅助决策和分析之用；而后一种结构比较适合于实现简单的地图发布、空间查询等应用，主要面向的是广大的Internet用户。由于这两种结构各有优缺点，而从指挥中心的总体角度来看，两种结构的应用都是不可缺少的。系统的总体结构将是一个同时包含了C/S和B/S两种结构的混合型、综合型结构。系统结构如下：!_v_images/20191120213209.png包括但不限于下列功能：空间数据维护以地理信息空间数据库和数据仓库的方式方便地统一管理地理空间数据和相应的属性数据，并能够对空间数据进行数据转载、转换、存储、更新等操作。GIS制图与输出基于地理信息系统平台，以多种比例的电子地图为基础，各种比例尺空间数据库能够无缝嵌套使用。图素的分专题图绘制图素的分层绘制图例、标注的绘制栅格数据的嵌入地图的硬拷贝输出GIS空间分析根据空间分析作用的数据性质不同，分为：①基于空间图形数据的分析运算；②基于非空间属性的数据运算；③空间和非空间数据的联合运算。解决所涉及到地理空间的实际问题，提取和传输地理空间信息，特别是隐含信息，以辅助决策空间专题分析空间专题分析的目的是解决某类与地理空间有关的问题，涉及多种空间分析操作的组合。空间专题分析的定制空间专题分析的存储空间专题分析的修改空间专题分析的扩展专题分析数据的输入专题分析数据的输出空间查询管理检索某类与地理空间有关的数据。", "产品设计/昆明供电段应急指挥系统解决方案.md": "参考：电力应急指挥解决方案www.techstar.com.cn/caseinfo.aspx?m=20100723115246312667融智通电网应急指挥解决方案www.rongzhitong.com/jjfa/jjfa51.html中科软应急指挥系统解决方案www.sinosoft.com.cn/khyal/E_ggws_news/ggws_news_0001.html一、概述昆明供电段应急指挥系统解决方案是一个充分利用现代网络技术、计算机技术和多媒体技术，以**基础资源数据库、知识库为基础，以地理信息系统、数据分析系统、信息表示系统**为手段，实现对**应急情况数据的收集、分析、对应急指挥的辅助决策、对应急资源的组织、协调和管理控制**等指挥功能。该系统在面对突发事件时，能够为指挥领导和参与指挥的业务人员和专家，提供各种通讯和信息服务，提供决策依据和分析手段以及指挥命令实施部署和监督方法，能及时、有效地调集各种资源，实施险情控制和抢险工作，用最有效的控制手段和小的资源投入，将损失控制在最小范围内。**方案实现目标**对各种应急预案进行管理，包括预案分类、分级以及预案附件上传，包括应急预案的增加、删除、修改、查询、附件下载和基本信息的导出。在数据采集和信息处理方面，实现应急情况（异常信息）的采集、传输、存储、处理、分析、预案确定及启动全过程的信息化、自动化和网络化。在预警方面，建立处理突发事件信息管理网络，实现对突发事件的评估与预警触发启动；在会商方面，利用视频接收设备、通讯系统、数据库系统、地理信息系统（GIS）等设施，为指挥领导、业务人员和专家提供大屏幕显示和信息服务，随时为领导决策提供各种有效而生动的辅助决策信息；在决策支持方面，形成一套具有实时监测、科学预测、及时有效发布和动态反馈评估等功能的辅助决策系统，实现对突发事件应急处理的决策支持。在资源调度方面，通过接入第三方物资管理系统对应急资源（线路图纸、工具、材料等）的科学调度，充分保证对特定突发事件应急处理所需资源的配置。**方案特色**应急指挥系统的建设是建立在光芒集成开发平台之上的，平台为应急指挥提供服务和数据的支撑，保证基础数据的共享、服务的共用，在基础软硬件上提供了保障。在监测、预警和应急领域提供“监测、预警、应急”一体化的应急决策指挥解决方案，实现系统“平战结合”的建设思想。基于我们在铁路供电行业的业务积累，应急指挥系统将以多样化、可扩展的可靠信息渠道解决应急指挥中必须的信息来源问题；基于数据仓库和数据挖掘技术，提供多类行业的数据分析和预警模型，实现监测与预警联动；光芒集成开发平台提供了门户集成技术和关键指标仪表盘设计技术，结合系统中丰富的系统分析模块，实现各种业务数据的显示界面集成，便于决策者快速、直观地了解信息、把握全局；以业界主流和开放的技术标准和设计模式，提供开放的、平台级的应用编程接口和管理工具，既满足供电段快速拓展和实施系统，又便于保护投资，使系统长期健康发展。二、总体框架应急指挥系统涉及领域广，技术层次深，系统的构架也是比较复杂，总体来讲，其框架图如下：!_v_images/20191120212750.png光芒公司依据铁路供电领域的应急决策指挥的要求，结合以往的应急指挥系统的经验，在光芒集成开发基础平台基础上，进一步细化应用框架到可实施框架，从下向上依次是**基础设施层、数据中心层、资源整合层、应用支撑层、应用层、综合门户**，并有安全保障体系和运行维护与支持体系保障系统的正常运行。如下图所示：!_v_images/20191120212805.png基础设施层：整个系统的底层是信息系统的基础设施，这包括网络及通讯设施、主机服务器及存储系统、视频会议系统、大屏幕数据演示系统，以及操作系统、数据库管理系统及网络通讯基础设施等，这些是系统最基本的运行基础。数据中心：数据是整个系统的基础，基础数据经过采集、处理、标准化、传输、存储，形成系统资源库，为系统提供了高效的业务分析、决策、交换、共享的数据环境。主要包括以下数据库：知识数据库预案数据库应急事件库应急材料库设备资源（图纸、物资等）数据库地理信息空间数据库组织基础数据库人员基础数据库资源整合层：应急指挥需要多部门、多系统联动配合，如果彼此孤立，不能实现信息共享，就会形成的“信息孤岛”。造成缺乏可比数据、缺乏分析、缺乏管理。难以获得全面的业务信息，就会影响业务和决策的效率和准确性。通过提供应用整合服务、业务整合服务、数据整合服务连接相关职能部门的系统、业务、数据，最大程度的解决信息孤岛，最大限度地利用现有的数据资源。应用支撑层：应用支撑层的设计直接影响系统的稳定性、安全性及可靠性等重要因素，光芒公司凭借多年的软件开发经验，采用低耦合，高内聚的设计思想，基于开放的标准在该层部署应用部件，为系统高效、可靠的运行提供保障。包括：GIS服务流程引擎全文检索消息中间件信息推送服务内容管理数据交换权限管理报表服务应用层光芒公司应急决策系统根据突发事件应急的特点，综合各种数据信息及处理软件，缺省提供了辅助会商决策系统、数据收集与管理系统、信息处理与分析系统、资源管理系统、信息发布系统等应用系统，并可根据需要，快速的扩展业务系统。综合门户综合门户系统建立了一个灵活、规范的信息组织管理平台和全网范围的网络协作环境，实现集成的信息采集、内容管理、信息搜索，能够直接组织各类共享信息和内部业务基础信息，面向不同使用对象，通过门户技术实现个性化服务，从而实现初步的信息整合；门户不同的用户提供个性化、服务，实现用户的统一认证、统一管理，提供实时信息访问及多系统协同工作。三、基础设施解决方案应急基础平台是基于先进信息技术、网络技术、GIS技术、通信技术和应急信息资源基础上的，充分利用现有资源，依托供电段信息化建设，建立统一应急指挥网络平台，实现紧急事件报警的统一接入与交换。根据突发公共事件突发性、区域性、持续性等特点，以及应急组织指挥机构及其职责、工作流程、应急响应、处置步骤、处置方案等应急业务的集成，应急指挥系统基础平台建设主要包括以下几个方面。1.音视频系统；2.会议系统；3.通信系统；4.后勤保障系统音视频系统：音视频系统贯穿在整个应急指挥中心的日常工作、应急受理、指挥调度、管理系统等等各种活动中，是应急指挥系统最有效的信息获取、协调指挥的手段之一；是应急指挥系统与指挥人员人机交互的最主要的表现形式。包括但不限于下列子系统：音视频整合系统（将各种不同格式的音像信号整合后接入指挥中心）大屏幕显示系统远程视频监控视频点播系统综合指挥席会议系统：会议系统是应急指挥系统对于突发事件进行协调处理、信息分析、决策以及指令下达的重要工具，实现各级指挥部门直接交流，成为应急指挥系统最有效的信息获取，协调指挥的手段之一。包括但不限于下列子系统：数字会议系统电话会议系统视频会议系统通信系统为应急抢修通过通信保障，应急指挥通信平台整合现有通信资源，如视频会议终端、手机、调度电话、行政电话、集群、卫星通信、PAD等都作为应急指挥中的通信手段，有效的融合，才能保证指令的有效下达，最终才能做到信息对称。应急指挥中心的通信系统即要覆盖多个下级部门，同时又要保障与上级的通信，实现在紧急状况下调度指挥和协调管理。包括但不限于下列子系统：有线通信系统无线通信系统后勤保障系统后勤保障系统的作用是确保应急指挥平台各种设备的可靠运行，确保各种应急数据的传输、存储及灾备，并为指挥中心内部人员提供安全和舒适的工作环境。包括但不限于下列子系统：机房建设（包括机房装修、配电、空调等）综合布线系统计算机网络系统数据存储系统异地灾备系统音、视频存储系统中央控制系统安防系统（含监控和门禁系统）不间断电源系统四、软件解决方案!_v_images/20191120212828.png应急指挥系统主要功能1、异常信息监测功能完成各自对异常信息（应急情况）的监控监测，而应急指挥系统从这些系统获取异常信息，并管理好这些异常信息。对发生的应急情况进行分析，确定应急事件的类型、等级，否是构成启动对应的应急预案。突发事件的发生具有分散性、隐蔽性、积聚性和突发性的特点，因此根据这些特点建立了异常信息监测的机制，能从接触网、电力、变电等系统通过数据的抽取发现突发事件隐患的功能，并利用各种数据挖掘工具，进行突发事件信息的挖掘分析，做到突发事件及早发现、消灭，提前预防、及时处理。2、异常信息分析与预警根据坚持预防为主的原则，突发事件应急系统需要根据不同专业特点建立各种突发事件预测预警模型，日常管理系统不断为模型输入参数，一旦模型计算结果出现异常情况时，系统必须能够通过预先设定的途径进行报警，并自动通过电话、传真、Email、短信等方式提醒突发事件相关人员。3、会商决策抢修中，领导在应急指挥中心，可以随时享受现场传回的照片，视频录像，文字，语音汇报，有利于分析决策，可以与现场人员任意组织会议对工作加以指导和了解。即使有些领导因为出差，无法及时赶赴现场，现场实施人员可通过系统上报现场的照片，或者语音，或者视频、录像让不在现场的领导也可以清楚的了解到现场的进展情况，并加入与现场的互动，快速作出指示。4、应急资源管理与调度应急指挥中心根据应急事件等级和预案对所涉应急资源集中管理和统一调度。由于各个专业应急指挥中心涉及的不同专业的应急资源具有不同的调度权限，应急资源的调度指令的下达根据调度权限逐级下达。应急资源的现场调度情况，通过系统直接反馈到应急指挥部，指挥中心根据现场情况及时进行预案的调整。并且系统具备应急资源分配功能，能够设置本专业应急资源的空间分布、资源属性以及分配和调度方式。5、应急事件录入功能除了通过应急事件数据采集模块及数据整合模块获得基础数据外，通过该功能能够对应急事件进行补充（包括文字信息、数据信息、图片信息、录象信息、空间位置信息等），便于系统进行应急事件分析，建立抢修方案。在抢修完成后，可以将处理结果录入到系统，完成对应急事件的管理。6、应急知识库管理通过收集国内外铁路供电行业的应急事件所需各种知识，汇总编排后录入系统，提供综合查询、对外使用接口等功能，快速简易的查询知识库内容。7、教育培训功能系统能够通过统一的综合门户系统，建立各个专业应急教育培训栏目，为应急指挥工作人员加强专业技能培训，广大铁路职工提供应对突发事件的基础知识。通过培训教育，提高工作人员指挥分析能力，提供广大铁路职工应对突发事件的应对能力。7、地理信息系统（GIS）支持GIS电子地图作为业务信息的载体，可提供对业务信息在地图上的直观定位、可视化展示、查询和专题分析。利用地理信息特有的空间关联关系，可以建立多种业务信息之间的空间关联关系，寻找业务信息之间的分布规律和空间关系，为指挥决策、情报分析等提供依据。利用地理信息可以实现对控制力量、命令执行情况的动态管理与监督，对应急态势的实时掌控，实现对应急力量的科学化管理、合理的调度。GIS系统是应急指挥中心系统的重要辅助系统，它利用SOA模型设计出包含了多层次的多种应用和技术组件，为用户提供基于网络的桌面、移动服务以及应用程序的Web服务。包括但不限于下列功能：空间数据维护以地理信息空间数据库和数据仓库的方式方便地统一管理地理空间数据和相应的属性数据，并能够对空间数据进行数据转载、转换、存储、更新等操作。GIS制图与输出基于地理信息系统平台，以多种比例的电子地图为基础，各种比例尺空间数据库能够无缝嵌套使用。GIS空间分析解决所涉及到地理空间的实际问题，提取和传输地理空间信息，特别是隐含信息，以辅助决策空间专题分析空间专题分析的目的是解决某类与地理空间有关的问题，涉及多种空间分析操作的组合。空间查询管理检索某类与地理空间有关的数据。", "产品设计/水力发电生产管理信息系统.md": "项目内容新华水力发电集团生产管理信息系统（以下简称“PMIS”）是以新华发电公司发展规划确定的管理为基础，配合集团体制、机制、管理和技术的持续创新，充分利用现代信息技术，建立和形成满足集团公司及其分子公司的协同运转、高效管理和科学决策需要的新华发电公司综合信息系统。系统建设内容主要体现在以下三个方面：1、建立电厂运行实时数据采集平台。分析研究集团所属各类发电厂对电厂运行实时信息的需求情况和利用方法，建立一套集团统一的电厂运行指标体系标准，并依据该标准设计出数据库的主要数据结构，同时保留可扩充性。针对集团总部、区域分公司和各发电厂对实时数据需求的不同，按照统一的接口标准分别提取各自所需的关键指标数据，并进行长期存储和加工处理。2、建立各级电厂运行实时监测系统。在集团公司本部，以抽取上来的各发电厂实时数据为基础，建设集团电厂运行实时监测系统，成为集团公司未来的生产监测指挥中心。在各区域分公司，以抽取上来的各发电厂实时数据为基础，建设区域分公司运行实时监测系统，成为区域分公司未来的运行监测指挥中心。在各发电厂，以建立的实时数据库为基础，建设运行实时监测系统。3、为集团化生产调度提供所需信息。实现对各下属发电厂生产运营状况的在线监视，跟踪机组运行状态，反映其生产运营中发生的生产事故和有较大影响的紧急事件,并能通过系统实时向总公司报告；满足生产运营信息的收集、整理、汇总、分析及向集团公司上报的要求；分析所辖电厂机组运行的经济性，指导协调管辖电厂的生产运营和电力市场有关工作。系统架构PMIS全面基于面向服务的体系架构（SOA）和N层B/S体系模式，自底向上分为基础设施层、数据层、基础应用层、业务应用层和表示层。采用分层的技术架构具有很强的扩展性、可维护性和安全性。系统功能架构如下图所示：!_v_images/20191120205015.png", "产品设计/水电厂运行管理系统.md": "项目内容水电厂运行管理系统（以下简称“HOMS”）是在先进的设计理念和管理思想的基础上，充分结合水电企业的运行管理特点和电厂生产管理的业务需求，专门为水电企业管理者量身定做的产品，因此该系统符合湖南白竹洲水电站信息化建设要求。HOMS以发电生产、设备为核心，以工单为主线，全面覆盖水电企业生产、资产、经营、预算、决策支持等管理领域，并可将生产实时数据与管理信息有机集成，帮助水电企业及下属电厂快速有效地构建管控一体、分层管理的信息化集成平台。项目建设内容主要包括运行值班、运行台账管理、定期工作管理、工作票管理、操作票管理、设备管理、缺陷管理、实时系统、物资管理、相关方管理、检修管理、安全管理、标准资料管理、系统管理等应用功能。系统架构HOMS全面基于面向服务的体系架构（SOA）和N层B/S体系模式，自底向上分为基础设施层、数据层、基础应用层、业务应用层和表示层。采用分层的技术架构具有很强的扩展性、可维护性和安全性。HOMS提供对移动设备（安卓操作系统）的产品支持，即水电厂运行管理安卓客户端系统（HOMSforAndroid），该系统基于Android（安卓）平台设备，与HOMS系统同步的数据库，协助企业便捷高效地进行水电企业信息化管理。系统功能架构如下图所示：!_v_images/20191120205041.png", "产品设计/水电站生产运行管理系统.md": "水电站生产运行管理系统1、设备管理系统采用树状与列表型双结构管理电站内设备，通过树状结构可以方便的查找到目的设备以及父子关系的设备，从而完成对现场设备的监控和跟踪，并进行维护和更新设备和运行位置的基本信息。另外设备可以与我公司KKS水电编码系统联合使用完成对设备编码和定位的目的。2、物资管理物资管理指对物品或工具的接收、保管、保养、发放、回收等环节的过程控制，本模块主要包括库存管理、物资入库、物质出库、领料与退料、库存盘点、物资采购等。3、工具管理工器具的管理包括日常借用、归还和日常维护，此外还有专用工具的年检和安全试验、工器具的报修、报废和添置等。4、运行管理运行部是电厂的核心部门，担负着上级部门下发到全厂发电任务的重任，因此发电运行的管理功能也是本系统的重点。运行管理模块基本囊括了运行过程中日常的各种记录与操作过程，同时提供方便灵活的两票流程处理功能，为电站和员工提供了安全工作的保障。主要内容有各种运行记录、ON_CALL记录、实时参数记录、规程管理、两票管理和相应报表输出等。5、安全监督管理完善的安全监督工作可以达到减少事故、促进工作的目的，本系统安全监督功能包含了水电站常见的各项工作，如：安全性评价、人员安全管理、设施安全管理、异常故障管理、安措管理、事故管理、安全检查管理、上级指令管理、安全文明生产管理、两票考核管理、安全奖惩管理等。6、预防性维护管理通过合理的预防性维修可以达到防止意外事故、预防计划外停机的目的。通过本功能可以建立预防性维修计划来定义在设备或位置上周期性执行的预防性维修工作。系统支持按照时间、里程表、日历、季节和时间触发的预防性维修。此外，还可以产生需要对多个位置和设备同时进行的检查性预防性维修，也可以通过建立预防性维修计划来定义电厂的大小修项目。7、故障代码管理管理设备或工具的故障信息代码，对每个设备或者工具建立树状管理结构，故障代码信息包含故障代码编号、故障问题及现象、故障原因分析、故障处理措施等信息。通过对设备故障代码的出现趋势分析可以指导维护人员及时采取合适的预防性维护措施。同时历史代码也为今后故障诊断与处理提供有价值的参考作用。8、计划管理计划管理按照目前常用的一套现行计划管理体系编制，实现计划以及合同的电子化管理，该体系包括计划的申报、汇总、审核、批准、执行、完成情况评价等。9、员工管理实现对员工简历、培训、特殊工种及员工考核的管理。10、标准工作包在维修的过程中，可以把一些实际的经验和习惯的做法归纳总结起来，作成在执行某些特定工作任务的标准工作包供日后参考。11、查询统计统一管理系统中各种综合信息的统计查询与报表生成，通过管理员设置可以生成各种专业型查询统计报表，对系统状态一目了然。12、系统管理系统管理模块实现对水电站生产运行管理系统的设计、配置等功能。通过系统配置，我们能为水电站生产运行管理系统设计业务流程、规划系统授权、对现有的应用程序客户化修改以达到适应各项目的不同需求、对系统内的标准参数和运行参数进行配置、对系统辅助应用程序进行设置等。!_v_images/20191120205150.png", "产品设计/铁路6C业务结构.md": "!_v_images/20191120204812.png", "技术架构/01《构建高可用Linux服务器（第4版）》.md": "前言第1章　Linux服务器的性能调优11.1网站架构设计相关11.1.1评估网站性能涉及的专业名词术语11.1.2CDN业务的选项21.1.3IDC机房的选择31.2如何根据服务器应用来选购服务器41.3硬件对Linux性能的影响91.4CentOS6.8x86_64最小化安装后的优化111.4.1系统的基础优化111.4.2优化Linux下的内核TCP参数以提高系统性能191.4.3CentOS6.8x86_64系统最小化安装优化脚本211.4.4Linux下CPU使用率与机器负载的关系与区别231.5服务器调优实际案例251.6小结28第2章　Shell脚本在生产环境下的应用292.1Shell编程基础292.1.1Shell脚本基本元素302.1.2Shell基础正则表达式302.1.3Shell特殊字符322.1.4变量和运算符332.2Shell中控制流结构452.3Sed的基础用法及实用举例482.3.1Sed的基础语法格式482.3.2Sed的用法举例说明532.4awk的基础用法及实用举例562.5Shell基础正则表达式举例612.6Shell开发中应该掌握的系统知识点682.7生产环境下的Shell脚本742.7.1AmazonLinux系统简介742.7.2生产环境下的备份类脚本752.7.3生产环境下的监控类脚本782.7.4生产环境下的运维开发类脚本842.8小结88第3章　利用Vagrant搭建分布式环境893.1Vagrant简单介绍893.2Vagrant安装903.3使用Vagrant配置本地开发环境913.3.1Vagrant的具体安装步骤913.3.2Vagrant配置文件详解933.3.3Vagrant常用命令详解953.4使用Vagrant搭建分布式环境963.5小结99第4章　轻量级自动化运维工具介绍1004.1轻量级自动化运维工具pssh介绍1014.1.1pssh的安装1034.1.2pssh的使用1034.2轻量级自动化运维工具Fabric介绍1054.2.1Fabric的安装1054.2.2Fabric的命令行入口fab命令详细介绍1074.2.3Fabric的环境变量设置1084.2.4Fabric的核心API1094.2.5Fabric的执行逻辑1124.2.6如何利用进程池大小来限制Fabric并发进程数1144.3Fabric在工作中应用实例1144.3.1开发环境中Fabric应用实例1154.3.2工作场景中常见的Fabric应用实例1164.4小结120第5章　Linux集群及其项目案例分享1215.1负载均衡高可用核心概念及常用软件1215.1.1什么是负载均衡高可用1215.1.2以F5BIGIP作为负载均衡器1225.1.3以LVS作为负载均衡器1235.1.4以Nginx作为负载均衡器1325.1.5以HAProxy作为负载均衡器1325.1.6高可用软件Keepalived1345.1.7高可用软件Heartbeat1345.1.8高可用块设备DRBD1355.2负载均衡关键技术1365.2.1什么是Session1365.2.2什么是Session共享1365.2.3什么是会话保持1375.3负载均衡器的会话保持机制1385.3.1LVS的会话保持机制1385.3.2Nginx负载均衡器中的ip_hash算法1425.3.3HAProxy负载均衡器的source算法1455.4服务器健康检测1505.5Linux集群的项目案例分享1515.5.1用LVS+Keepalived建高可用集群1515.5.2用Nginx+Keepalived实现在线票务系统1545.5.3企业级Web负载均衡高可用之Nginx+Keepalived1575.5.4HAProxy双机高可用方案之HAProxy+Keepalived1695.5.5巧用DNS轮询作负载均衡1795.5.6百万级PV高可用网站架构设计1845.5.7千万级PV高性能高并发网站架构设计1875.6软件级负载均衡器的特点介绍与对比1935.7四层负载均衡和七层负载均衡工作流程的对比1945.8Linux集群的总结和思考1965.9小结198第6章　MySQL性能调优及高可用案例分享2006.1MySQL数据库的优化2006.1.1服务器物理硬件的优化2006.1.2MySQL配置文件的优化2016.1.3MySQL上线后根据status状态进行适当优化2046.1.4利用tuningprimer脚本进行数据库调优2126.1.5MySQL架构设计调优2166.2MySQL数据库的高可用架构方案2166.2.1生产环境下的DRBD+Heartbeat+MySQL双机高可用2176.2.2生产环境下的MySQL数据库主从Replication同步2286.3小结240第7章　Linux防火墙介绍2427.1基础网络知识2427.1.1OSI网络参考模型2427.1.2TCP/IP三次握手的过程详解2437.1.3Socket应用2457.1.4其他基础网络知识2477.2Linux防火墙的状态机制2477.3Linux防火墙在企业中的应用2477.4Linux防火墙的语法2487.5iptables的基础知识2527.5.1iptables的状态state2527.5.2iptables的Conntrack记录2547.5.3关于iptables模块的说明2557.5.4iptables防火墙初始化的注意事项2567.5.5如何保存运行中的iptables规则2567.6如何流程化编写iptables脚本2577.7学习iptables应该掌握的工具2607.7.1命令行的抓包工具TCPDump2607.7.2图形化抓包工具Wireshark2617.7.3强大的命令行扫描工具Nmap2647.7.4使用TCPPing工具检测TCP延迟2667.8iptables的简单脚本学习2677.8.1普通的Web主机防护脚本2677.8.2如何让别人ping不到自己，而自己能ping通别人呢？2697.8.3建立安全的vsftpd服务器2717.9线上生产服务器的iptables脚本2757.9.1安全的主机iptables防火墙脚本2757.9.2自动分析黑名单及白名单的iptables脚本2787.9.3利用recent模块限制同一IP的连接数2817.9.4利用DenyHosts工具和脚本来防止SSH暴力破解2857.10　工作中的Linux防火墙总结2877.11　小结289第8章　Linux系统安全相关篇2908.1TCP_wrappers应用级防火墙的介绍和应用2908.2DDos攻击和运营商劫持2928.3Linux服务器的安全防护2948.3.1Linux服务器基础防护篇2948.3.2Linux服务器高级防护篇2958.4Linux系统如何防止入侵3018.5小结301附录A　GibLab在开发工作中的实际应用302附录B　SublimeText3的快捷键操作308附录C　调试网络接口的利器Postman315附录D　RSYNC及INOTIFY在工作中的应用321", "技术架构/02-分布式事务.md": "springcloud微服务微服务架构的分布式事务解决方案www.roncoo.com/article/detail/124243分布式事务的典型处理方式:2PC、TCC、异步确保和最大努力型kaimingwan.com/post/fenbushi/fenbushishiwudedianxingchulifangshi2pctccyibuquebaohezuidanulixingACIDzh.wikipedia.org/wiki/ACIDAtomicity（原子性）：一个事务（transaction）中的所有操作，或者全部完成，或者全部不完成，不会结束在中间某个环节。即，事务不可分割、不可约简。Consistency（一致性）：在事务开始之前和事务结束以后，数据库的完整性没有被破坏。这表示写入的资料必须完全符合所有的预设约束、触发器、级联回滚等。Isolation（隔离性）：数据库允许多个并发事务同时对其数据进行读写和修改的能力，隔离性可以防止多个事务并发执行时由于交叉执行而导致数据的不一致。事务隔离分为不同级别，包括未提交读（Readuncommitted）、提交读（readcommitted）、可重复读（repeatableread）和串行化（Serializable）。Durability（持久性）：事务处理结束后，对数据的修改就是永久的，即便系统故障也不会丢失。RDBMS事务隔离级别并发问题几个场景脏读：一个事务读取了另一个事务操作但未提交的数据。比如A、B两个事务，都操作同一张表，A刚刚对数据进行了操作（插入、修改等）但还没有提交，这时B读取到了A刚刚操作的数据，因为A有可能回滚，所以这部分数据有可能只是临时的、无效的，即脏数据。不可重复读：一个事务中的多个相同的查询返回了不同数据。比如A、B两个事务，A中先后有两次查询相同数据的操作，第一次查询完之后，B对相关数据进行了修改，造成A事务第二次查询出的数据与第一次不一致。幻读：事务并发执行时，其中一个事务对另一个事务中操作的结果集的影响。比如A、B两个事务，事务A操作表中符合条件的若干行。事务B插入符合A操作条件的数据行，然后再提交。后来发现事务A并没有如愿对“所有”符合条件的数据行做了修改。四个事务隔离级别Readuncommitted读未提交：如果设置了该隔离级别，则当前事务可以读取到其他事务已经修改但还没有提交的数据。这种隔离级别是最低的，会导致上面所说的脏读Readcommitted读已提交：如果设置了该隔离级别，当前事务只可以读取到其他事务已经提交后的数据，这种隔离级别可以防止脏读，但是会导致不可重复读和幻读。这种隔离级别最效率较高，并且不可重复读和幻读在一般情况下是可以接受的，所以这种隔离级别最为常用。Repeatableread可重复读：如果设置了该隔离级别，可以保证当前事务中多次读取特定记录的结果相同。可以防止脏读、不可重复读，但是会导致幻读。Serializable串行化：如果设置了该隔离级别，所有的事务会放在一个队列中执行，当前事务开启后，其他事务将不能执行，即同一个时间点只能有一个事务操作数据库对象。这种隔离级别对于保证数据完整性的能力是最高的，但因为同一时刻只允许一个事务操作数据库，所以大大降低了系统的并发能力。CAP定理一致性（Consistency）（等同于所有节点访问同一份最新的数据副本）可用性（Availability）（每次请求都能获取到非错的响应――但是不保证获取的数据为最新数据）分区容错性（Partitiontolerance）（以实际效果而言，分区相当于对通信的时限要求。系统如果不能在时限内达成数据一致性，就意味着发生了分区的情况，必须就当前操作在C和A之间做出选择3。）根据定理，分布式系统只能满足三项中的两项而不可能满足全部三项4。理解CAP理论的最简单方式是想象两个节点分处分区两侧。允许至少一个节点更新状态会导致数据不一致，即丧失了C性质。如果为了保证数据一致性，将分区一侧的节点设置为不可用，那么又丧失了A性质。除非两个节点可以互相通信，才能既保证C又保证A，这又会导致丧失P性质。BASE理论（在微服务下的事务管理必然要遵循新的法则）BASE理论是对CAP理论的延伸，核心思想是即使无法做到强一致性，应用应该可以采用合适的方式达到最终一致性。BASE是指基本可用（BasicallyAvailable）、软状态（SoftState）、最终一致性（EventualConsistency）。基本可用：指分布式系统在出现故障的时候，允许损失部分可用性，即保证核心可用。软状态：允许系统存在中间状态，而该中间状态不会影响系统整体可用性。分布式存储中一般一份数据至少会有三个副本，允许不同节点间副本同步的延时就是软状态的体现。最终一致性：最终一致性是指系统中的所有数据副本经过一定时间后，最终能够达到一致的状态。弱一致性和强一致性相反，最终一致性是弱一致性的一种特殊情况。参考：对比5种分布式事务方案，还是宠幸了阿里的Seata（原理+实战）mp.weixin.qq.com/s?__biz=MzU0OTE4MzYzMw==&mid=2247497767&idx=3&sn=727bff63c4598e93f6f6e4a67e780e37&chksm=fbb171d9ccc6f8cff428ec385babf069fc4d3bce9a5258446cd0e1763d4e80f886c1ea14fbec&&xtrack=1&scene=90&subscene=93&sessionid=1606710118&clicktime=1606710436&enterid=1606710436rd分布式事务，这一篇就够了xiaomiinfo.github.io/2020/01/02/distributedtransaction/分布式事务的典型处理方式：2PC、TCC、异步确保和最大努力型kaimingwan.com/post/fenbushi/fenbushishiwudedianxingchulifangshi2pctccyibuquebaohezuidanulixing分布式事务有哪5中方案常见的比如基于XA协议的2PC、3PC，基于业务层的TCC，还有应用消息队列+消息表实现的最终一致性方案，还有今天要说的Seata中间件开发中幂等性是极为重要的。简单来说，对于同一个系统，在同样条件下，一次请求和重复多次请求对资源的影响是一致的，就称该操作为幂等的。2PCXA协议中分为两部分：事务管理器和本地资源管理器。其中本地资源管理器往往由数据库实现，比如Oracle、MYSQL这些数据库都实现了XA接口，而事务管理器则作为一个全局的调度者。优点：严格保障事务ACID特性；想使用本地事务一样透明；对业务侵92很小。缺点：强一致性的同步阻塞协议，锁定全部资源。3PC是2PC的一种改进版本。CanCommit、PreCommit、DoCommit三个阶段。在第一阶段，只是询问所有参与者是否可可以执行事务操作，并不在本阶段执行事务操作。当协调者收到所有的参与者都返回YES时，在第二阶段才执行事务操作，然后在第三阶段在执行commit或者rollback。2PC中只有协调者有超时机制，3PC在协调者和参与者中都引入了超时机制，协调者出现故障后，参与者就不会一直阻塞。多了一次网络通信，性能上反而变得更差TCCTCC为在业务层编写代码实现的两阶段提交。TCC分别指Try、Confirm、Cancel，一个业务操作要对应的写这三个方法。以下单扣库存为例，Try阶段去占库存，Confirm阶段则实际扣库存，如果库存扣减失败Cancel阶段进行回滚，释放库存。TCC不存在资源阻塞的问题，因为每个方法都直接进行事务的提交，一旦出现异常通过则Cancel来进行回滚补偿，这也就是常说的补偿性事务。TCC对业务的侵入性很强。消息事务（最终一致性）消息事务其实就是基于消息中间件的两阶段提交，将本地事务和发消息放在同一个事务里，保证本地操作和发送消息同时成功。!消息事务（最终一致性）_v_images/20210625094850448_27262.pngSeataSeata也是从两段提交演变而来的一种分布式事务解决方案，提供了AT、TCC、SAGA和XA等事务模式，这里重点介绍AT模式。几种角色TransactionCoordinatorTC:全局事务协调者，用来协调全局事务和各个分支事务（不同服务）的状态，驱动全局事务和各个分支事务的回滚或提交。TransactionManager64:事务管理者，业务层中用来开启/提交/回滚一个整体事务（在调用服务的方法中用注解开启事务）。ResourceManagerRM:资源管理者，一般指业务数据库代表了一个分支事务（BranchTransaction），管理分支事务与TC进行协调注册分支事务并且汇报分支事务的状态，驱动分支事务的提交或回滚。!Seata角色_v_images/20210625094929103_13071.pngSeata实现分布式事务，设计了一个关键角色UNDO_LOG（回滚日志记录表），我们在每个应用分布式事务的业务库中创建这张表，这个表的核心作用就是，将业务数据在更新前后的数据镜像组织成回滚日志，备份在UNDO_LOG表中，以便业务异常能随时回滚。Seata执行的两个阶段第一个阶段：本地事务提交，业务数据的更新和前面生成的UNDOLOG数据一并提交，并将本地事务提交的结果上报给全局事务协调者TC。第二阶段：根据各分支的决议做提交或回滚。Seata实践file.conf文件用于配置持久化事务日志的模式，目前提供file、db、redis三种方式。registry.conf文件设置注册中心和配置中心：目前注册中心支持nacos、eureka、redis、zk、consul、etcd3、sofa七种。SeataClient注册服务：新建三个服务orderserver（下单服务）、storageserver（扣减库存服务）、accountserver（账户金额服务），分别服务注册到注册中心。用@GlobalTransactional注解开启一个全局事务即可。", "技术架构/02《深入理解Java虚拟机2nd》.md": "第2章Java内存区域与内存溢出异常2.2运行时数据区域!_v_images/20200403094930.png2.2.1程序计数器（ProgramCounterRegister）较小的内存空间字节码的行号指示器“线程私有”无OutOfMemoryError情况2.2.2Java虚拟机栈线程私有，生命周期与线程相同方法的调用过程对应着一个栈帧（StackFrame）在虚拟机栈中入栈到出栈的过程栈帧存储方法的局部变量表、操作数栈、动态链接、方法出口等信息局部变量表存放了编译期可知的各种基木数据类型、对象引用reference、returnAddress类型局部变量表所需的内存空间在编译期间已经确定两种异常状况：如果线程请求的栈深度大于虚拟机所允许的深度，将抛出StackOverflowError异常如果虚拟机栈可以动态扩展，如果扩展时无法申请到足够的内存，就会抛出OutOfMemoryError异常2.2.3本地方法栈（NativeMethodStack）类似虚拟机栈，为调用Native方法服务也会抛出StackOverflowError和OutOfMemoryError异常2.2.4Java堆（heap）被所有线程共享的一块大内存所有的对象实例以及数组都要在堆上分配堆是垃圾收集器管理的主要区域物理上不连续、逻辑上是连续的即可如果在堆中没有内存完成实例分配，并且堆也无法再扩展时，将会她出OutOfMemoryError异常2.2.5方法区（MethodArea,NonHeap）被所有线程共享存储类信息、常量、静态变量、JIT编译后的代码等为堆的一个逻辑部分可以不实现垃圾收集，这区域的内存回收目标主要是针对常量池的回收和对类型的卸载2.2.6运行时常量池（RuntimeConstantPool）存放各种字面量和符号引用运行期间也可能将新的常量放人池中2.2.7直接内存不是虚拟机运行时数据区的一部分超过物理内存的限制，可导致OutOfMemoryError异常NIO的DirectByteBuffer对象直接操作这块内存的引用设置Xmx2.3HotSpot虚拟机对象探秘", "技术架构/03《高性能MySQL》.md": "第一章MySQL架构与历史1.1MySQL的逻辑架构!MySQL逻辑架构_v_images/20210625103345187_236.png1.3事务ACID原子性（atomicity）：一个事务必须被视为一个不可分割的最小工作单元，整个事务中的所有操作要么全部提交成功，要么全部失败回滚。一致性（consistency）：数据库总是从一个一致性的状态转换到另外一个一致性的状态。隔离性（isolation）：通常来说，一个事务所做的修改在最终提交以前，对其他事务是不可见的。持久性（durability）：一旦事务提交，则其所做的修改就会永久保存到数据库中。1.3.1隔离级别READUNCOMMITTED（未提交读）：事务可以读取未提交的数据，这也被称为脏读（DirtyRead）。在实际应用中一般很少使用。READCOMMITTED（提交读）：一个事务从开始直到提交之前，所做的任何修改对其他事务都是不可见的。这个级别有时候也叫做不可重复读（nonrepeatableread）REPEATABLEREAD（可重复读）：该级别保证了在同一个事务中多次读取同样记录的结果是一致的。它解决了脏读的问题，无法解决另外一个幻读（PhantomRead）的问题。幻读：指的是当某个事务在读取某个范围内的记录时，另外一个事务又在该范围内插入了新的记录，当之前的事务再次读取该范围的记录时，会产生幻行（PhantomRow）。SERIALIZABLE（可串行化）：它通过强制事务串行执行，避免了前面说的幻读的问题。SERIALIZABLE会在读取的每一行数据上都加锁，所以可能导致大量的超时和锁争用的问题。1.3.2死锁当多个事务试图以不同的顺序锁定资源时，就可能会产生死锁。多个事务同时锁定同一个资源时，也会产生死锁。为了解决这种问题，数据库系统实现了各种死锁检测和死锁超时机制。InnoDB目前处理死锁的方法是，将持有最少行级排他锁的事务进行回滚。死锁发生以后，只有部分或者完全回滚其中一个事务，才能打破死锁。1.3.3事务日志使用事务日志，存储引擎在修改表的数据时只需要修改其内存拷贝，再把该修改行为记录到持久在硬盘上的事务日志中，而不用每次都将修改的数据本身持久到磁盘。事务日志采用的是追加的方式，顺序I/O，而不是随机I/O，快得多。预写式日志（WriteAheadLogging）：事务日志持久以后，内存中被修改的数据在后台可以慢慢地刷回到磁盘。事务日志恢复数据。1.4多版本并发控制InnoDB的MVCC，是通过在每行记录后面保存两个隐藏的列来实现的。这两个列，一个保存了行的创建时间，一个保存行的过期时间（或删除时间）。当然存储的并不是实际的时间值，而是系统（事务）版本号。1.5MySQL的存储引擎MySQL会在数据库子目录下创建一个和表同名的.frm文件保存表的定义。1.5.1InnoDB存储引擎", "技术架构/04《Redis开发与运维》.md": "第5章持久化Redis支持RDB和AOF两种持久化机制5.1RDB方式RDB持久化是把当前进程数据生成**快照**保存到硬盘的过程。5.1.1触发机制（触发情形）1、根据配置规则进行自动快照。`savemn`2、手动触发：用户执行SAVE或BGSAVE命令3、执行FLUSHALL命令4、从节点执行全量复制操作（replication）时。5、执行debugreload命令重新加载Redis时6、未开启AOF持久化时，执行shutdown命令5.1.2流程说明（bgsave执行过程）!bgsave命令的运作过程_v_images/20210712174803220_27164.png5.1.4RDB优缺点!vx_images/11303818220151.png=207x优点：全量复制，方便备份、恢复。恢复速度远快于AOF。缺点：无法实时持久化。新老版本RDB文件格式不兼容。5.2AOF方式AOF以独立日志的方式记录每次写命令。主流方式。5.2.1使用AOF（AOF工作流程）!AOF工作流程_v_images/20210712183316362_8848.pngappend命令写入：命令是文本协议。sync文件同步：利用Linux的页缓冲区，先write到缓冲区，然后fsync强制阻塞写入磁盘。rewrite重写：（1）去掉无效的命令、超时的数据、合并命令来压缩AOF文件。（2）手动触发+自动触发。load重启加载：优先加载AOF文件，不存在AOF文件时加载RDB文件第6章复制Redis提供了复制replication功能，自动将更新的数据从主库同步到其他从库。一主多从原理：从库启动后，向主库发送SYNC命令后，主库立即执行RDB快照，并缓存此期间接收到的命令；快照完成后，主库向从库发送快照文件和缓存命令；从库载入快照文件并执行缓存命令。完成复制初始化后，主库不断将写命令同步到从库。主库之从库可以为下一级从库的主库。即可以构建多级复制的结构。从库持久化另一个相对耗时的操作是持久化，为了提高性能，可以通过复制功能建立一个或若干个从数据库，并在从数据库中启用持久化，同时在主数据库禁用持久化。当从数据库崩溃重启后主数据库会自动将数据同步过来，所以无需担心数据丢失。当开启复制且主数据库关闭持久化功能时，一定不要使用Supervisor以及类似的进程管理工具令主数据库崩溃后自动重启。哨兵能解决手工维护从库或主库的重启以及数据恢复的麻烦。无硬盘复制开启无硬盘复制选项后，Redis在与从库进行复制初始化时将不会将快照内容存储到硬盘上，而是直接通过网络发送给从库，避免了硬盘的性能瓶颈。增量复制第9章哨兵哨兵包括两个功能：1、监控主库和从库运行状态。2、出现故障时，自动将从库转换为主库。哨兵典型架构多哨兵架构第10章集群集群的特点在于拥有和单机实例同样的性能，同时在网络分区后能够提供一定的可访问性以及对主数据库故障恢复的支持。另外集群支持几乎所有的单机实例支持的命令，对于涉及多键的命令如MGET，如果每个键都位于同一个节点中，则可以正常支持，否则会提示错误。除此之外集群还有一个限制是只能使用默认的0号数据库，如果执行SELECT切换数据库则会提示错误。哨兵与集群是两个独立的功能，但从特性来看哨兵可以视为集群的子集，当不需要数据分片或者已经在客户端进行分片的场景下哨兵就足够使用了，但如果需要进行水平扩容，则集群是一个非常好的选择。", "技术架构/22【诸葛_JAVA从零开始开发区块链技术】.md": "TOC学习过程区块链（BlockChain）结构解析blog.csdn.net/yinanmo5569/article/details/80313710Python开发区块链Python实现最简单的区块链mp.weixin.qq.com/s?src=11&timestamp=1570764209&ver=1905&signature=Fo09EY6xZp2oEL6cH7XjnOhKIiPn63xU0ey2*Ws3yCEzOEZ0nfrStidxbVzmWcaAIQeyvzxbCJn5CfgCZZ7KVM2liEKThiiXCPeYqttVPBFUhj893uKxmmxC9T5ibKr&new=1用Python从零开始创建区块链learnblockchain.cn/2017/10/27/build_blockchain_by_python/1第1课1.1比特币1.1.1比特币起源BitcoinBTC:APeertoPeerElectronicCashSystem点对点电子现金系统中本聪在2009年初挖出第一批比特币总量不超过2100万枚1.1.2比特币底层机制去中心化，P2P分布式数字货币系统共识机制POW工作量证明非对称加密算法数字签名区块链账本技术1.1.3比特币特性硬通货跨境交易易携带只需一个私钥隐秘性只暴露钱包地址无货币超发1.1.4比特币钱包钱包就是P2P里的P节点，主要用来管理私钥和比特币转账地址钱包分类轻钱包只存储维护跟你自己交易相关的数据中心化钱包数字货币交易所钱包下载地址：bitcoin.org/zh_CN/download1.1.5比特币产生比特币由矿工挖矿产生生成的比特币被记录在矿工的名下比特币通过矿工的公钥哈希值锁定比特币通过交易UTXO在节点之间转移UTXO未花费的交易1.2区块链1.2.1区块链分布式账本系统!_v_images/20191120203705.png共识机制POW工作量证明通过挖矿证明自己是善意节点，并获得生成区块和在该区块记账的权利基于P2P网络，每个全节点都存储着最全的比特币交易记录新区块通过包含前一个区块头部的哈希值区块的唯一标识建立链接关系区块里装的就是所有的比特币交易记录UTXO1.2.2区块链网络区块链节点矿工运行于强大或专用的硬件（比如ASIC）之上，主要目的是挖矿全节点这些节点验证矿工挖出来的块的有效性，并对交易进行确认。SPV节点简单支付验证，如钱包节点1.2.3区块链挖矿在全网中和其他节点竞争计算解一个难题的过程证明自己是非恶意节点获得的权利和义务记账权把交易写入区块里广播义务把区块在全网广播获得的奖励挖矿奖励12.5BTC收取交易手续费1.2.4区块链共识机制拜占庭将军问题共识机制之一!_v_images/20191120203727.pngPOWProofofWork工作量证明通过付出大量工作代价证明自己是非恶意节点计算一个随机数nonce，算出的正确随机数即POW获取记账权利打包交易并通知其它节点理性人都是逐利的，POW抑制了节点的恶意动机1.2.5区块链交易确认当一项交易被链上的区块收录后，就是交易确认在此区块之后每产生一个区块，此项交易的确认数相应加1经过6个以上区块确认的交易才是安全确认的，因为篡改成本巨大比特币钱包可以设置交易确认数1.2.6区块链区块生成!_v_images/20191120203748.png矿工在挖矿前要组建区块将coinbase交易打包进区块将交易池中高优先级的交易打包进区块创建区块头部!_v_images/20191120203804.png挖矿成功后，将计算出来的随机数noncePOW填入区块头部，并向临近节点传播1.2.7区块链区块验证相邻节点收到新区块后，立即做以下验证验证POW的nonce值是否符合难度值检查时间戳是否小于当前时间两小时检查merkle树根是否正确检查区块size要小于区块size的上限第一笔交易必须是coinbase交易验证每个交易1.2.8区块链分类公有链任何人都可以参与使用和维护，信息公开，如比特币，以太坊等联盟链若干组织共同维护，使用有权限限制，信息受保护，如银联组织私有链集中管理者进行限制，内部少数人可以使用，信息不公开1.2.9区块链篡改账本双花问题：同一笔比特币被支付多次!_v_images/20191120203825.png!_v_images/20191120204008.png!_v_images/20191120204032.png!_v_images/20191120204051.png1.3密码学1.3.1密码学对称加密对称加密加解密钥相同缺点：无法确保密钥被安全传递常用算法：DES、3DES（TripleDES）、AES等!_v_images/20191120204311.png1.3.2密码学非对称加密非对称加密公私钥加密对，公钥加密，私钥解密!_v_images/20191120204322.png!_v_images/20191120204333.png公钥由私钥生成，私钥可以推导出公钥从公钥无法推导出私钥优点：解决了密钥传输中的安全行问题常用算法：RSA、ECC（椭圆曲线加密算法使用场景：SSH安全验证等问题：解决了信息传送的问题，如何验证发送方是正确的了?1.3.3密码学哈希Hash哈希将一段数据任意长度经过计算转换成一段定长的数据不可逆性几乎无法通过哈希的结果推导出原文无碰撞性两个不同原文哈希后的结果一定不同常用算法：MD5，SHA256使用场景数据库中的用户密码存储MD5挖矿计算SHA2561.3.4密码学数字签名数字签名公私钥加密对，私钥签名，公钥解签名使用场景比特币交易验证等!_v_images/20191120204346.png1.3.5Java实现区块链与比特币区块链结构挖矿生成新区块共识机制比特币交易比特币钱包区块链P2P网络通讯!_v_images/20191120204402.png比特派第2课区块链整体结构设计与实现共识机制工作量证明原理挖矿算法!_v_images/20191120204416.png```java//挖矿算法//创建一个空的区块链List<Block>blockchain=newArrayList<>;//生成创世区块Blockblock=newBlock1,System.currentTimeMillis,newArrayList<Transaction>,1,\"1\",\"1\";//加入创世区块到区块链里blockchain.addblock;System.out.printlnJSON.toJSONStringblockchain;//创建一个空的交易结合List<Transaction>txs=newArrayList<>;Transactiontx1=newTransaction;Transactiontx2=newTransaction;Transactiontx3=newTransaction;txs.addtx1;txs.addtx2;txs.addtx3;//加入系统奖励的交易TransactionsysTx=newTransaction;txs.addsysTx;//获取当前区块链里的最后一个区块BlocklatestBlock=blockchain.getblockchain.size1;intnonce=1;Stringhash=\"\";whiletrue{hash=CryptoUtil.SHA256latestBlock.getHash+JSON.toJSONStringtxs+nonce;ifhash.startsWith\"0000\"{System.out.println\"=====计算结果正确，计算次数为：\"+nonce+\",hash:\"+hash;break;}nonce++;System.out.println\"计算错误，hash:\"+hash;}BlocknewBlock=newBlocklatestBlock.getIndex+1,System.currentTimeMillis,txs,nonce,latestBlock.getHash,hash;blockchain.addnewBlock;System.out.println\"挖矿后的区块链：\"+JSON.toJSONStringblockchain;```!_v_images/20191120204437.png密码学非对称加密非对称加密公私钥加密对，共要加密，私钥解密公钥由私钥生成，私钥可以推到出公钥从公钥无法推导出私钥优点：解决了密钥传输中的安全问题常用算法：RSA、ECC（椭圆曲线加密算法）使用场景：SSH安全验证等问题：解决了信息传送的问题，如何验证发送方是正确的？!_v_images/20191120204516.png```JAVA@TestpublicvoidtestEncryptthrowsException{System.err.println\"公钥加密――私钥解密\";StringinputStr=\"abc\";bytedata=inputStr.getBytes;byteencodedData=RSACoder.encryptByPublicKeydata,publicKey;bytedecodedData=RSACoder.decryptByPrivateKeyencodedData,privateKey;StringoutputStr=newStringdecodedData;System.err.println\"加密前:\"+inputStr+\"\\n\\r\"+\"解密后:\"+outputStr;assertEqualsinputStr,outputStr;}```密码学哈希（Hash）哈希讲一段数据（任意长度）经过计算转换成一段定长的数据不可逆性几乎无法通过哈希的结果推导出原文无碰撞行两个不同原文哈希后的结果一定不同常用算法：MD5、SHA256使用场景：数据库中的用户密码存储（MD5）挖矿计算（SHA256）密码学数字签名1、数字签名：公私钥加密对，私钥签名，公钥验证签名。2、使用场景：比特币交易验证等。!_v_images/20191120204542.png```JAVA@TestpublicvoidtestSignthrowsException{System.err.println\"私钥签名――公钥验证签名\";StringinputStr=\"sign\";bytedata=inputStr.getBytes;//产生签名Stringsign=RSACoder.signdata,privateKey;System.err.println\"签名:\\r\"+sign;//验证签名booleanstatus=RSACoder.verifydata,publicKey,sign;System.err.println\"状态:\\r\"+status;assertTruestatus;}```生成钱包```JAVA//本地生成公私钥对Map<String,Object>initKey=RSACoder.initKey;StringpublicKey=RSACoder.getPublicKeyinitKey;StringprivateKey=RSACoder.getPrivateKeyinitKey;returnnewWalletpublicKey,privateKey;```3第3课：比特币的设计与实现比特币交易UTXO交易输出交易输入比特币余额3.1比特币UTXOUTXOunspenttransactionoutput未花费交易输出比特币拥有者的公钥锁定（加密）的一个数字UTXO就是比特币，比特币系统中只有UTXO,没有比特币新的UTXO由挖矿或交易产生UTXO存在全节点的数据库里转账交易消耗自己的UTXO,同时生成新的UTXO,并用接受者的公钥锁定比特币系统中用户的“余额”实际上并不直接存在，而是通过计算得来3.2比特币交易模型交易输出（UTXO）锁定的比特币数量锁定脚本（用接收者的公钥哈希）交易输入（UTXO+解锁脚本）解锁脚本（发送者的签名和公钥）签名对发送者和接收者的公钥哈希以及整个交易签名!_v_images/20191120204624.png!_v_images/20191120204643.png3.2比特币交易全流程!_v_images/20191120204701.pngcoinbase的系统交易，input为空。3.3交易代码```JAVA//交易发起方WalletwalletSender=Wallet.generateWallet;//交易接收方WalletwalletReciptent=Wallet.generateWallet;TransactionInputtxIn=newTransactionInputtx2.getId,10,null,walletSender.getPublicKey;TransactionOutputtxOut=newTransactionOutput10,walletReciptent.getHashPubKey;Transactiontx3=newTransactionCryptoUtil.UUID,txIn,txOut;//假定tx2之前已经被打包进区块，也就是已经被记录进账本了tx3.signwalletSender.getPrivateKey,tx2;txs.addtx3;```3.4签名代码对发送者和接收者的公钥哈希以及整个交易签名```java/***用私钥生成交易签名**@paramprivateKey*@paramprevTx*/publicvoidsignStringprivateKey,TransactionprevTx{ifcoinbaseTx{return;}if!prevTx.getId.equalstxIn.getTxId{System.err.println\"交易签名失败：当前交易输入引用的前一笔交易与传入的前一笔交易不匹配\";}TransactiontxClone=cloneTx;txClone.getTxIn.setPublicKeyprevTx.getTxOut.getPublicKeyHash;Stringsign=\"\";try{sign=RSACoder.signtxClone.hash.getBytes,privateKey;}catchExceptione{e.printStackTrace;}txIn.setSignaturesign;}/***生成用于交易签名的交易记录副本**@return*/publicTransactioncloneTx{TransactionInputtransactionInput=newTransactionInputtxIn.getTxId,txIn.getValue,null,null;TransactionOutputtransactionOutput=newTransactionOutputtxOut.getValue,txOut.getPublicKeyHash;returnnewTransactionid,transactionInput,transactionOutput;}```", "技术架构/25 移动网关设计.md": "Featureapp登录认证（可以供手机app或桌面程序登录使用）基于URL的权限校验控制（授权有平台的portal完成）服务转发（将dubbo服务转换为httpjson服务）待完成的功能服务反向路由，网关要负责将外部请求反向路由到内部具体的微服务，这样虽然企业内部是复杂的分布式微服务结构，但是外部系统从网关上看到的就像是一个统一的完整服务，网关屏蔽了后台服务的复杂性，同时也屏蔽了后台服务的升级和变化。安全认证和防爬虫，所有外部请求必须经过网关，网关可以集中对访问进行安全控制，比如用户认证和授权，同时还可以分析访问模式实现防爬虫功能，网关是连接企业内外系统的安全之门。限流和容错，在流量高峰期，网关可以限制流量，保护后台系统不被大流量冲垮，在内部系统出现故障时，网关可以集中做容错，保持外部良好的用户体验。监控，网关可以集中监控访问量，调用延迟，错误计数和访问模式，为后端的性能优化或者扩容提供数据支持。日志，网关可以收集所有的访问日志，进入后台系统做进一步分析。除以上基本能力外，网关还可以实现线上引流，线上压测，线上调试Surgicaldebugging，金丝雀测试CanaryTesting，数据中心双活ActiveActiveHA等高级功能。网关通常工作在7层，有一定的计算逻辑，一般以集群方式部署，前置LB进行负载均衡。开源的网关组件有Netflix的Zuul，特点是动态可热部署的过滤器filter机制，其它如HAproxy，Nginx等都可以扩展作为网关使用。设计原理请求认证过程!_v_images/20191129171128.pnglogin获取AccessKey和SecretKey。AccessKey是有一定的时效性，过期后需要重新登录获取。请求httpjson服务。所有的服务都需要进行header的签名校验。对应的程序调用过程如下：!_v_images/20191129171137.png签名算法签名算法的原理如下图所示，用户登录后，获取AccessKey和SecretKey（这两个key都有一定的时效性），客户端和服务端各自保存同一个SecretKey，SecretKey不在请求中传递的；stringToSign是有客户端生成的，并要传递到服务端，客户端和服务端用SecretKey和stringToSign生成签名Signature；客户端的Signature需要传递到服务端，服务端收到客户端的Signature后，和服务端自己生成的Signature进行比较，如果相等则认为是合法请求，否则不合法；这个签名Signature每次请求是不一样的。!_v_images/20191129171202.png移动网关中除了login之外，所有请求服务端API接口的请求均使用此签名算法进行校验。!_v_images/20191129171207.png算法如上图所示，对于客户端来说，AccessKey和SecretKey是用户登录后获得到的；HttpMethod、ContentType、requestURI是HTTP的请求属性，可以统一设置；ContentMD5是用户请求内容的MD5后的字符串，date是当前时间的长整形值（毫秒）。权限校验控制权限校验是采用基于URL的校验，即将用户可访问的URL放入用户权限缓存中，用户发出每次请求时，校验用户是否具有该URL的访问权限，如果有权限，则http的返回码是200，否则返回码为401。服务转发系统所使用的所有服务接口是以dubbo服务的形式发布，移动网关将dubbo服务转换为httpjson的API，网关只是做一个请求的转发，并将结果返回给客户端app。代码如下：```javaStringinterfaceName=getPara\"interface\";StringmethodName=getPara\"method\";StringparaValues=getParaValues\"params\";log.debug\"AccessAPI:{}{}\",interfaceName,methodName;Class<?>clazz=null;try{clazz=Class.forNameinterfaceName;}catchClassNotFoundExceptione{thrownewIllegalArgumentException\"Couldnotfindinterface\"+interfaceName+\"\";}DubboReferenceFactory.initPropertyHolder.get\"dubbo.register.center\",\"APIGATEWAY\";Objectobj=DubboReferenceFactory.createReferenceclazz,\"dubbo\";Objectresult=ReflectionUtil.invokeMethodByNameobj,methodName,paraValues;ifresult!=null{renderJsonresult;}```客户端调用```javaURLurl=newURLbaseUrl+\"admin\";HttpPostmethod=newHttpPosturl.toURI;StringcontentType=\"application/json;charset=utf8\";Stringentity=\"ladygaga\";Headerheaders=buildHeaderApiKey.ADMIN2,method,contentType,entity;method.setHeadersheaders;method.setEntitynewStringEntityentity,ContentType.createcontentType;HttpResponseexecute=client.executemethod;StatusLinestatusLine=execute.getStatusLine;```完整的调用过程参见测试用例HmacTest", "技术架构/OAuth2认证.md": "参考：帮你深入理解OAuth2.0协议blog.csdn.net/seccloud/article/details/8192707OAuth2集成――《跟我学Shiro》jinnianshilongnian.iteye.com/blog/2038646一、OAuth基础介绍目前实现开放授权的方法分为两种：一种是使用OAuth协议1；另一种是使用IAM服务2。OAuth协议主要适用于针对个人用户对资源的开放授权，比如Google的用户Alice。OAuth的特点是“现场授权”或“在线授权”：客户端主要通过浏览器去访问资源，授权时需要认证Alice的资源所有者身份，并且需要Alice现场审批。OAuth一般在SNS服务中广泛使用，如微博。IAM服务则不同，它的特点是“预先授权”或“离线授权”：客户端主要通过RESTAPI方式去访问资源，资源所有者可以预先知道第三方应用所需要的资源请求，一次授权之后，很少会变更。IAM服务一般在云计算服务中使用，如AWS服务、阿里云计算服务。OAuth角色**资源拥有者（resourceowner）**：能授权访问受保护资源的一个实体，可以是一个人，那我们称之为最终用户；如新浪微博用户zhangsan；**资源服务器（resourceserver）**：存储受保护资源，客户端通过accesstoken请求资源，资源服务器响应受保护资源给客户端；存储着用户zhangsan的微博等信息。**授权服务器（authorizationserver）**：成功验证资源拥有者并获取授权之后，授权服务器颁发授权令牌（AccessToken）给客户端。**客户端（client）**：如新浪微博客户端weico、微格等第三方应用，也可以是它自己的官方应用；其本身不存储资源，而是资源拥有者授权通过后，使用它的授权（授权令牌）访问受保护资源，然后客户端把相应的数据展示出来/提交到服务器。“客户端”术语不代表任何特定实现（如应用运行在一台服务器、桌面、手机或其他设备）。OAuth协议流程!_v_images/20191129175350.png1.客户端从资源拥有者那请求授权。授权请求可以直接发给资源拥有者，或间接的通过授权服务器这种中介，后者更可取。2.客户端收到一个授权许可，代表资源服务器提供的授权。3.客户端使用它自己的私有证书及授权许可到授权服务器验证。4.如果验证成功，则下发一个访问令牌。5.客户端使用访问令牌向资源服务器请求受保护资源。6.资源服务器会验证访问令牌的有效性，如果成功则下发受保护资源。授权类型授权码AuthorizationCodeGrant、最核心、最难理解、也是最广泛使用的一种授权类型隐式授权ImplicitGrant、RO凭证授权ResourceOwnerPasswordCredentialsGrant、Client凭证授权ClientCredentialsGrant。二、SessionAuthenticationvsTokenAuthentication参考：SessionAuthenticationvsTokenAuthenticationsecurity.stackexchange.com/questions/81756/sessionauthenticationvstokenauthenticationControltheSessionwithSpringSecuritywww.baeldung.com/springsecuritysession1.In**SessionbasedAuthentication**theServerdoesalltheheavyliftingserverside.Broadlyspeakingaclientauthenticateswithitscredentialsandreceivesasession_idwhichcanbestoredinacookieandattachesthistoeverysubsequentoutgoingrequest.Sothiscouldbeconsidereda\"token\"asitistheequivalentofasetofcredentials.Thereishowevernothingfancyaboutthissession_idString.Itisjustanidentifierandtheserverdoeseverythingelse.Itisstateful.Itassociatestheidentifierwithauseraccounte.g.inmemoryorinadatabase.Itcanrestrictorlimitthissessiontocertainoperationsoracertaintimeperiodandcaninvalidateitiftherearesecurityconcernandmoreimportantlyitcandoandchangeallofthisonthefly.Furthermoreitcanlogtheuserseverymoveonthewebsites.Possibledisadvantagesarebadscaleabilityespeciallyovermorethanoneserverfarmandextensivememoryusage.2.In**TokenbasedAuthentication**nosessionispersistedserversidestateless.Theinitialstepsarethesame.CredentialsareexchangedagainstatokenwhichisthenattachedtoeverysubsequentrequestItcanalsobestoredinacookie.Howeverforthepurposeofdecreasingmemoryusage,easyscaleabilityandtotalflexibilitytokenscanbeexchangedwithanotherclientastringwithallthenecessaryinformationisissuedthetokenwhichischeckedaftereachrequestmadebytheclienttotheserver.Thereareanumberofwaystouse/createtokens:ausingahashmechanisme.g.HMACSHA1>token=user_id|expiry_date|HMACuser_id|expiry_date,kidandexpiry_idaresentinplaintextwiththeresultinghashattachedkisonlyknowtotheserverbencryptingthetokensymmetricallye.g.withAES>token=AESuser_id|expiry_date,xxrepresentstheen/decryptionkeycencryptingitasymmetricallye.g.withRSA>token=RSAuser_id|expiry_date,privatekey**Productivesystems**areusuallymorecomplexthanthosetwoarchetypes.Amazonforexampleusesbothmechanismsonitswebsite.Alsohybridscanbeusedtoissuetokensasdescribedin2andalsoassociateausersessionwithitforusertrackingorpossiblerevocationandstillretaintheclientflexibilityofclassictokens.AlsoOAuth2.0usesshortlivedandspecificbearertokensandlongerlivedrefreshtokense.g.togetbearertokens.", "技术架构/Sharding-JDBC.md": "TOC一、什么是ShardingJDBCShardingJDBC定位为轻量级Java框架，在Java的JDBC层提供的额外服务。它使用客户端直连数据库，以jar包形式提供服务，无需额外部署和依赖，可理解为增强版的JDBC驱动，完全兼容JDBC和各种ORM框架。二、ShardingJDBC能做什么分库&分表读写分离分布式主键分布式事务三、适用项目框架ShardingJDBC适用于：任何基于Java的ORM框架，如：JPA,Hibernate,Mybatis,SpringJDBCTemplate或直接使用JDBC。基于任何第三方的数据库连接池，如：DBCP,C3P0,BoneCP,Druid,HikariCP等。支持任意实现JDBC规范的数据库，目前支持MySQL，Oracle，SQLServer和PostgreSQL。四、Maven依赖```XML<!shardingjdbc开始><dependency><groupId>io.shardingsphere</groupId><artifactId>shardingcore</artifactId><version>${sharding.version}</version></dependency><dependency><groupId>io.shardingsphere</groupId><artifactId>shardingjdbcspringnamespace</artifactId><version>${sharding.version}</version></dependency><!如果不配置分布式事务的话配置上边两个就够了><!分布式事务引用依赖><dependency><groupId>io.shardingsphere</groupId><artifactId>shardingtransaction2pcxa</artifactId><version>${sharding.version}</version></dependency><dependency><groupId>io.shardingsphere</groupId><artifactId>shardingtransactionspring</artifactId><version>${sharding.version}</version></dependency><!shardingjdbc结束><!AspectJAOP支持><dependency><groupId>org.aspectj</groupId><artifactId>aspectjweaver</artifactId><version>${aspectjweaver.version}</version></dependency>```五、读写分离5.1数据源配置先配置数据源也可以配置读写分离以下配置是ds0和ds1两个数据库的主和从一共四个数据源。parentDs是数据源公共的配置，抽出去以免写重复代码。```XML<!ds0的主><beanid=\"ds0_master\"class=\"com.alibaba.druid.pool.DruidDataSource\"destroymethod=\"close\"parent=\"parentDs\"><propertyname=\"driverClassName\"value=\"\"/><propertyname=\"url\"value=\"\"/></bean><!ds0的从><beanid=\"ds0_slave\"class=\"com.alibaba.druid.pool.DruidDataSource\"destroymethod=\"close\"parent=\"parentDs\"><propertyname=\"driverClassName\"value=\"\"/><propertyname=\"url\"value=\"${sharding.connection.url.0}\"/></bean><!ds1的主><beanid=\"ds1_master\"class=\"com.alibaba.druid.pool.DruidDataSource\"destroymethod=\"close\"parent=\"parentDs\"><propertyname=\"driverClassName\"value=\"\"/><propertyname=\"url\"value=\"${sharding.connection.url.1}\"/></bean><!ds1的从><beanid=\"ds1_slave\"class=\"com.alibaba.druid.pool.DruidDataSource\"destroymethod=\"close\"parent=\"parentDs\"><propertyname=\"driverClassName\"value=\"\"/><propertyname=\"url\"value=\"${sharding.connection.url.1}\"/></bean>```5.2读写分离配置只配置主从不配置分库分表的情况如下，如果要配置分库分表则不需要下面这个配置。masterdatasourcename是主数据源IDslavedatasourcenames是从数据源ID```XML<masterslave:datasourceid=\"masterSlaveDataSource\"masterdatasourcename=\"ds0_master,ds1_master\"slavedatasourcenames=\"ds0_slave,ds1_slave\"><masterslave:props><propkey=\"sql.show\">${sql_show}</prop><propkey=\"executor.size\">10</prop><propkey=\"foo\">bar</prop></masterslave:props></masterslave:datasource>```5.3读写分离和分库分表一起配置如果读写分离和分库分表一起使用的话把主从路由配置到shardingdatasource下就可以了。sharding:masterslaverule的id就是配置出来的逻辑的数据源的名称，如果多个从的话还可以通过配置strategyref来配置负载均衡。masterdatasource配置的是主库数据源ID。slavedatasource配置的是从库数据源ID，多个以逗号分开。```XML<!sharding数据源><sharding:datasourceid=\"shardingDataSource\"><!读写分离的话要把所有的主从数据源都写在这里><sharding:shardingruledatasourcenames=\"ds0_master,ds0_slave,ds1_master,ds1_slave\"><!读写分离的路由一主一从配置strategyref><sharding:masterslaverules><sharding:masterslaveruleid=\"ds0\"masterdatasourcename=\"ds0_master\"slavedatasourcenames=\"ds0_slave\"/><sharding:masterslaveruleid=\"ds1\"masterdatasourcename=\"ds1_master\"slavedatasourcenames=\"ds1_slave\"/></sharding:masterslaverules><!读写分离配置结束><sharding:tablerules><!―这里是分库分表路由的配置></sharding:tablerules><sharding:bindingtablerules><!―绑定表的配置></sharding:bindingtablerules></sharding:shardingrule><sharding:props><!显示SQL><propkey=\"sql.show\">true</prop></sharding:props></sharding:datasource>```六、数据分片6.1分片支持ShardingJDBC提供了5种分片策略。由于分片算法和业务实现紧密相关，因此ShardingJDBC并未提供内置分片算法，而是通过分片策略将各种场景提炼出来，提供更高层级的抽象，并提供接口让应用开发者自行实现分片算法。**StandardShardingStrategy**标准分片策略。提供对SQL语句中的=,IN和BETWEENAND的分片操作支持。StandardShardingStrategy只支持单分片键，提供PreciseShardingAlgorithm和RangeShardingAlgorithm两个分片算法。PreciseShardingAlgorithm是必选的，用于处理=和IN的分片；RangeShardingAlgorithm是可选的，用于处理BETWEENAND分片，如果不配置RangeShardingAlgorithm，SQL中的BETWEENAND将按照全库路由处理。**ComplexShardingStrategy**复合分片策略。提供对SQL语句中的=,IN和BETWEENAND的分片操作支持。ComplexShardingStrategy支持多分片键，由于多分片键之间的关系复杂，因此ShardingJDBC并未做过多的封装，而是直接将分片键值组合以及分片操作符交于算法接口，完全由应用开发者实现，提供最大的灵活度。**InlineShardingStrategy**Inline表达式分片策略。使用Groovy的Inline表达式，提供对SQL语句中的=和IN的分片操作支持。InlineShardingStrategy只支持单分片键，对于简单的分片算法，可以通过简单的配置使用，从而避免繁琐的Java代码开发，如:tuser${user_id%8}表示t_user表按照user_id按8取模分成8个表，表名称为t_user_0到t_user_7。**HintShardingStrategy**通过Hint而非SQL解析的方式分片的策略。**NoneShardingStrategy**不分片的策略。6.2分片配置标准分片配置```XML<!标准分片策略。><beanid=\"demoUserStandardStrategy\"class=\"shard.strategy.DemoUserStandardStrategy\"/><sharding:standardstrategyid=\"shardingDemoUserStandardStrategy\"precisealgorithmref=\"demoUserStandardStrategy\"shardingcolumn=\"id\"rangealgorithmref=\"\"/>```DemoUserStandardStrategy标准分片要实现PreciseShardingAlgorithm接口，doSharding的两个参数一个是所有数据源的cllection.另一个参数是执行SQL时传过来的分片的值。```JAVA/***根据ID取*标准分片策略*用于处理=和IN的分片*@authoryulonggao*@date2019/1/3114:35*/@Slf4jpublicclassDemoUserStandardStrategyimplementsPreciseShardingAlgorithm<Long>{@OverridepublicStringdoShardingCollection<String>collection,PreciseShardingValue<Long>preciseShardingValue{//这个里边有异常会被处理掉，然后导致拿不到分片。但出异常一般是业务代码写错了。//每条指定分片的操作都会调用此方法，如果是in条件查询的话每个值会调用一次此方法，如果是批量插入也是每一条都要调用一次进行分片log.info\"DemoUserStandardStrategy_preciseShardingValue={}\",preciseShardingValue;Longsuffix=preciseShardingValue.getValue%4;log.info\"suffix={}\",suffix;finalStringtargetDb=String.valueOfMath.abssuffix.intValue;StringshardingValue=collection.stream.filterp>p.endsWithtargetDb.findFirst.get;log.info\"preciseShardingValue={},shardingValue={}\",preciseShardingValue,shardingValue;returnshardingValue;}```强制分片```xml<!强制路由分片策略><beanid=\"demoUserHintStrategy\"class=\"shard.strategy.DemoUserHintStrategy\"/><!强制路由例子使用><sharding:hintstrategyid=\"shardingDemoUserHintStrategy\"algorithmref=\"demoUserHintStrategy\"/>```DemoUserHintStrategy的Java如下，强制分片要实现HintShardingAlgorithm接口。```JAVA/***DemoUserHint强制路由分片策略,其实可以共用，只是例子*@authoryulonggao*@date2019/1/3114:35*/@Slf4jpublicclassDemoUserHintStrategyimplementsHintShardingAlgorithm{@OverridepublicCollection<String>doShardingCollection<String>availableTargetNames,ShardingValueshardingValue{//availableTargetNames这个参数是所有的dataSource的集合，shardingValue是HintManager传过来的分片信息log.info\"DemoUserHintStrategy_availableTargetNames={}\",availableTargetNames;log.info\"DemoUserHintStrategy_shardingValue={}\",shardingValue;ListShardingValuelistShardingValue=ListShardingValueshardingValue;CollectionshardingValueList=listShardingValue.getValues;//因为调用的时候分片是直接传的DataSource的名称，所以直接返回就可以了，如果传其它值则要加业务逻辑进行分片筛选//返回结果只能是availableTargetNames里边所包含的returnshardingValueList;}}```生成分部式ID的配置，生成主键的类要实现KeyGenerator接口。```XML<!―主键生成><beanid=\"keyId\"class=\"shard.key.DefaultKeyGenerator\"/>```!ShardingJDBC配置_v_images/20200604065002540_18818.png七、分布式事务把下面这行代码配置在spring里，shardingTransaction.xml是jar包里边带的。文件的源码只有两行配置：```XML<beanid=\"transactionManager\"class=\"org.springframework.jdbc.datasource.DataSourceTransactionManager\"><propertyname=\"dataSource\"ref=\"shardingDataSource\"></property></bean><tx:annotationdriventransactionmanager=\"transactionManager\"/><!事务支持><importresource=\"classpath:METAINF/shardingTransaction.xml\"/>```使用注解配置事务要同时使用ShardingTransactionType和Transactional两个注解。```JAVA/***注意：@ShardingTransactionType需要同Spring的@Transactional配套使用，事务才会生效。*@paramparam*@return*/@ShardingTransactionTypeTransactionType.XA@TransactionalrollbackFor=Exception.class@OverridepublicintaddParamDemoParamparam{log.info\"addParamparam={}\",param;returndemoParamDao.addParamparam;}```7.1支持程度完全支持非跨库事务，例如：仅分表或分库但是路由的结果在单库中。完全支持因逻辑异常导致的跨库事务。例如：同一事务中跨两个库更新，更新完毕后，抛出空指针，则两个库的内容都能回滚。支持数据库字段约束造成的回滚。八、其他问题关于orderby排序，如果排序的字段不在查询结果中，生成的SQL也会被带上，但结果不返回给你。不支持因网络、硬件异常导致的跨库事务。例如：同一事务中跨两个库更新，更新完毕后、未提交之前，第一个库死机，则只有第二个库数据提交。!_v_images/20200604065318535_1841.png九、参考文档shardingsphere.apache.org/document/current/cn/manual/shardingjdbc/usage/sharding/www.cnblogs.com/yixinjishu/p/10876071.html", "技术架构/WonderWare.md": "历史InTouch>收购SystemPlatform>在SP基础重新构建InTouch，提供丰富的HMI组成结构!_v_images/20191129170347.png!_v_images/20191129170411.pngMESMES制造执行系统manufacturingexecutionsystem，简称MES），包含**生产运营和资产管理**等，在WW中包括四个部分：生产管理Operations,设备绩效Performance,质量管理Quality,EnterpriseIntegration。**制造业信息化的三层模型**<divalign=\"center\">!_v_images/20191129170431.png</div>MES更多内容：MES互动百科www.baike.com/wiki/MES1.生产管理Operations生产流程2.设备绩效Performance设备使用率3.质量管理Quality生产事件自动触发：通过对设备的监控，根据监控的结果发起某一个生产流程SPC分析>报警样本计划4.批次管理Batch配方定义管理5.工作流Workflow事件触发工作流程SOP标准化工作流程整合不同的系统6.移动巡检作业IntelaTrac管理非智能设备现场作业与资产管理对接7.资产管理Avantis自动触发，维护工单8.历史数据库HistorianDB<divalign=\"center\">!_v_images/20191129170506.png</div>9.Data采集广泛的数据连接性设备的数据如何采集上来的？<divalign=\"center\">!_v_images/20191129170526.png</div>10.运营绩效分析Intelligence各种各样的数据集成开发环境11.EnterpriseIntegration预定义映射交换订单、物料、工艺集成ERP、MES支持多种Data交换格式**两化融合**：自动化+信息化InTouchHMI构建与WWSP之上。基于面向对象设计，所以设备都是对象，有对象定义，有对象实例。支持IDE来定义模板（定义对象），实例化对象（设备）。（替代方案：使用脚本？）**SituationalAwareness**：情景感知，扁平、简明、动画元素、高性能。WW新的HMI设计源于这本树《TheHighPerformanceHMIHandBook》的理念。!_v_images/20191129170551.png!_v_images/20191129170602.png!_v_images/20191129170611.png!_v_images/20191129170621.png!_v_images/20191129170627.png案例案例1：蓝鸟市政水业务介绍!_v_images/20191129170641.png组织架构!_v_images/20191129170651.png企业主要智能!_v_images/20191129170658.png系统框架!_v_images/20191129170705.png水务支持系统!_v_images/20191129170712.png案例2：能源管理系统解决方案What？它是什么？自动化+信息化动态监控+数字化管理!_v_images/20191129170721.pngGoal，系统目标!_v_images/20191129170727.pngHow，如何实现1）数据有效捕获2）建立能源管理规程3）PDCA持续改进方法论4）软硬件支持**PDCA方法论**!_v_images/20191129170741.png企业信息化架构!_v_images/20191129170749.png能源管理软件架构!_v_images/20191129170800.png影响能耗成本的因素!_v_images/20191129170806.png系统功能!_v_images/20191129170820.png", "技术架构/《大型网站技术架构》读书笔记.md": "《大型网站技术架构》读书笔记：当我们架设一个系统的时候通常需要考虑到如何与其他系统交互，所以我们首先需要知道各种系统之间是如何交互的，使用何种技术实现。1.不同系统不同语言之间的交互现在我们常见的不同系统不同语言之间的交互使用WebService，Http请求。WebService，即“Web服务”，简写为WS。从字面上理解，它其实就是“基于Web的服务”。而服务却是双方的，有服务需求方，就有服务提供方。服务提供方对外发布服务，服务需求方调用服务提供方所发布的服务。如果说得再专业一点，WS其实就是建立在HTTP协议上实现异构系统通讯的工具。没错！WS说白了还是基于HTTP协议的，也就是说，数据是通过HTTP进行传输的。最早我们是用CXF开发SOAP服务实现WS，后面我们是用REST服务实现WS这个目前使用比较多，也最我用得最多的这一种。基于CXF也可以开发REST服务，不过我们一般直接使用springMVC或者其他MVC框架实现REST服务。但是在很多人的印象中Webservice的话一般指十来年前IBM主导的基于XML的各种交互技术，现在除了一些公司在用之外用得人也很少了。广义的话Webservice就是Web服务了，一切皆服务。2.不同系统相同语言之间的交互常见的不同系统相同语言之间的交互用RPC远程过程调用，或者RMI远程方法调用实现，不用对外部提供服务，当然上面说的也可以使用在相同语言之间的交互,只是我常用的是RPC。1.1大型网站软件系统的特点与传统企业应用系统相比，大型互联网应用系统有以下特点。高并发，大流量高可用海量数据用户分布广泛，网络情况复杂安全环境恶劣需求快速变更，发布频繁渐进式发展1.2大型网站架构演化发展历程大型网站的技术挑战主要来自于庞大的用户，高并发的访问和海量的数据，任何简单的业务一旦需要处理数以P计的数据和面对数以亿计的用户，问题就会变得很棘手。大型网站架构主要就是解决这类问题1.2.1初始阶段的网站架构!_v_images/20191121205813.png初始阶段的小型系统应用程序、数据库、文件等所有的资源都在一台服务器上通俗称为LAMP特征：应用程序、数据库、文件等所有的资源都在一台服务器上。描述：通常服务器操作系统使用linux，应用程序使用PHP开发，然后部署在Apache上，数据库使用Mysql，汇集各种免费开源软件以及一台廉价服务器就可以开始系统的发展之路了。1.2.2应用服务和数据服务分离!_v_images/20191121205833.png好景不长，发现随着系统访问量的再度增加，webserver机器的压力在高峰期会上升到比较高，这个时候开始考虑增加一台webserver特征：应用程序、数据库、文件分别部署在独立的资源上。描述：数据量增加，单台服务器性能及存储空间不足，需要将应用和数据分离，并发处理能力和数据存储空间得到了很大改善。1.2.3使用缓存改善网站性能!_v_images/20191121210027.png特征：数据库中访问较集中的一小部分数据存储在缓存服务器中，减少数据库的访问次数，降低数据库的访问压力。描述：系统访问特点遵循二八定律，即80%的业务访问集中在20%的数据上。缓存分为本地缓存和远程分布式缓存，本地缓存访问速度更快但缓存数据量有限，同时存在与应用程序争用内存的情况。1.2.4使用应用服务器集群改善网站的并发处理能力!_v_images/20191121210041.png在做完分库分表这些工作后，数据库上的压力已经降到比较低了，又开始过着每天看着访问量暴增的幸福生活了，突然有一天，发现系统的访问又开始有变慢的趋势了，这个时候首先查看数据库，压力一切正常，之后查看webserver，发现apache阻塞了很多的请求，而应用服务器对每个请求也是比较快的，看来是请求数太高导致需要排队等待，响应速度变慢特征：多台服务器通过负载均衡同时向外部提供服务，解决单台服务器处理能力和存储空间上限的问题。描述：使用集群是系统解决高并发、海量数据问题的常用手段。通过向集群中追加资源，提升系统的并发处理能力，使得服务器的负载压力不再成为整个系统的瓶颈。1.2.5数据库读写分离!_v_images/20191121210054.png享受了一段时间的系统访问量高速增长的幸福后，发现系统又开始变慢了，这次又是什么状况呢，经过查找，发现数据库写入、更新的这些操作的部分数据库连接的资源竞争非常激烈，导致了系统变慢特征：多台服务器通过负载均衡同时向外部提供服务，解决单台服务器处理能力和存储空间上限的问题。描述：使用集群是系统解决高并发、海量数据问题的常用手段。通过向集群中追加资源，使得服务器的负载压力不在成为整个系统的瓶颈。1.2.6使用反向代理和CDN加速网站响应!_v_images/20191121210109.png特征：采用CDN和反向代理加快系统的访问速度。描述：为了应付复杂的网络环境和不同地区用户的访问，通过CDN和反向代理加快用户访问的速度，同时减轻后端服务器的负载压力。CDN与反向代理的基本原理都是缓存。1.2.7使用分布式文件系统和分布式数据库系统!_v_images/20191121210120.png随着系统的不断运行，数据量开始大幅度增长，这个时候发现分库后查询仍然会有些慢，于是按照分库的思想开始做分表的工作特征：数据库采用分布式数据库，文件系统采用分布式文件系统。描述：任何强大的单一服务器都满足不了大型系统持续增长的业务需求，数据库读写分离随着业务的发展最终也将无法满足需求，需要使用分布式数据库及分布式文件系统来支撑。分布式数据库是系统数据库拆分的最后方法，只有在单表数据规模非常庞大的时候才使用，更常用的数据库拆分手段是业务分库，将不同的业务数据库部署在不同的物理服务器上。1.2.8使用NoSQL和搜索引擎!_v_images/20191121210138.png特征：系统引入NoSQL数据库及搜索引擎。描述：随着业务越来越复杂，对数据存储和检索的需求也越来越复杂，系统需要采用一些非关系型数据库如NoSQL和分数据库查询技术如搜索引擎。应用服务器通过统一数据访问模块访问各种数据，减轻应用程序管理诸多数据源的麻烦。1.2.9业务拆分!_v_images/20191121210149.png特征：系统上按照业务进行拆分改造，应用服务器按照业务区分进行分别部署。描述：为了应对日益复杂的业务场景，通常使用分而治之的手段将整个系统业务分成不同的产品线，应用之间通过超链接建立关系，也可以通过消息队列进行数据分发，当然更多的还是通过访问同一个数据存储系统来构成一个关联的完整系统。纵向拆分：将一个大应用拆分为多个小应用，如果新业务较为独立，那么就直接将其设计部署为一个独立的Web应用系统纵向拆分相对较为简单，通过梳理业务，将较少相关的业务剥离即可。横向拆分：将复用的业务拆分出来，独立部署为分布式服务，新增业务只需要调用这些分布式服务横向拆分需要识别可复用的业务，设计服务接口，规范服务依赖关系。1.2.10分布式服务!_v_images/20191121210202.png参考知识库大型网站架构知识库", "技术架构/基于HMAC的REST安全认证.md": "REST中如何安全地处理用户登录问题？segmentfault.com/q/1010000000610275首先，服务器端的身份验证基本上有两类方式：一是基于Cookie的验证，一是基于Token的验证。选择哪一种要看你的实际情况。基于Cookie的验证历史悠久了，原理和做法无需赘言；近几年涌现了大量的公共API服务，它们基本上都使用了基于Token的验证，这主要是因为：1.处理跨域资源分享（CORS）――虽然Cookie＋CORS也不是完全不可能，但是比较难搞2.无状态性――有利于服务端扩展（伸缩性强）3.C/S解藕――服务器端和客户端可以完全分离，进而静态资源可以用CDN来处理，服务器端完全变成APIService4.CSRFFree――不依赖Cookie，完全不担心跨域伪造请求攻击（这点尚有疑虑，有待考证）……呃，忽然觉得有点跑题了，我的意思是你首先得选择一个验证方式，很明显基于Token的认证是趋势。接下来，假定选择了基于Token认证这条路，你首先得搞明白Token是怎么玩的。简单地说：**客户端先发送正确的认证信息（比如电子邮件＋密码），服务器端检查OK之后生成一个token返回给客户端，之后客户端所有的请求都要包含这个token，服务器端只需要验证该token是否有效即可**。这里有一张图，对比了Cookie－basedAuthtication和Token－basedAuthentication，挺不错的：!_v_images/20191129171255.png好，按照REST的设计原则，我们需要一个Endpoint供用户来请求认证并获取Token，比如像这样：*POST/authentication*在这里，“资源”就是认证（按照REST的要求，用名词来表示资源），使用POST方法去请求，附带数据为认证用的信息，返回结果看你的业务逻辑，但至少要有一个token。客户端拿到token之后，先把它存起来（比如存到SessionStorage里），设置请求时的HEADER里Authorization的值为Bearer<token>，完事了。综上所述，这事和REST的关系也就是设计一个获取Token的Endpoint而已，没啥了不起的，剩下的事情都属于业务逻辑，该怎么写就看你的需求了。怎样创建安全的RestWebServiceAPI请求dengyin2000.iteye.com/blog/548859**APIKey+SecretKey签名**比上一种跟复杂的一种方式就是用一个secretkey去签名每一刻APIURL请求，AmazonWebServices就是使用这种方式。当用户注册完后，你会给用户2个keys：APIKey（比如：username）和secretkey（比如password），APIkey会附在每个请求url上面，但是secretkey不会。secretkey是用来签名每个请求的。通常会加上另外一个参数比如（Signature）。Amazon会把所有的请求信息作为请求的参数，然后按照参数名排序，再按照secretkey进行hash。这个hash的值会作为一个新的参数（Signature）附加到请求的url上。在server端做相同的事情，获得所有的参数（除了Signature），排序，用sercetkeyhash，如果这个值跟传过来的Signature参数的值相等的话，则认为这个请求是合法的。融云Server开发指南www.rongcloud.cn/docs/server.html完全可以照这个文档来开发。注意以下几点：1.访问所有的API都需要签名Signature2.Signature由用户Key+SecretKey+随机数+时间数进行hash计算而来。3.Secretkey分别保存在客户端和服务端，随机数、时间数、Signature通过header传到server，结合SecretKey进行hash，然后进行校验。4.用户登录成功后，获得访问Token。Token作为客户端访问的凭证，可以设置一定的过期时间。5.授权信息可以通过Token作为key，缓存在shiro的缓存中。这篇文章的几张图很能说明原理，需要保存下来。hmacauthgithub.com/gjhuai/hmacauth第二十章无状态Web应用集成――《跟我学Shiro》jinnianshilongnian.iteye.com/blog/2041909", "技术架构/基于数据同步的云服务架构实践.md": "www.infoq.com/cn/presentations/cloudservicesarchitecturepracticebsedondatasynchronizationTOC野狗的数据同步理念Wilddog是什么？一个云端树形数据库一个App的所有的数据存到一个大JSON中事件驱动客户端Schemafree数据存储树形数据库像一颗Json树面向聚合数据之间的关系更直观完美的与Url结合每条数据都能通过url来唯一定位Path为key，keyvalue基于野狗的应用架构是这样的!_v_images/20191129173720.png数据副本的同步!_v_images/20191129173729.png数据同步的基本模型初始化慢同步fullsyncconditionsync增量同步本地besteffortpushoplog基于长连接保证有序性重连需要初始化慢同步!_v_images/20191129173811.png数据同步的架构演进架构特点写多读少写同步越实时越好读容忍一定延迟最终一致性并行写冲突实时操作幂等v0.1架构框图面向早期用户物化路径存储!_v_images/20191129173828.pngv0.2架构框图动态建库，app数据隔离Mongo提升读写性能副本集多活机枪换导弹（批量Batch数据操作）!_v_images/20191129173839.pngv0.3架构框图appIdtopic大大提升写性能（写缓冲队列kafka）类似Nagle减低写压力读性能下降!_v_images/20191129173848.png解决读的不一致问题幂等的覆盖模式操作!_v_images/20191129173858.pngv0.3.1架构框图keysxxx*引发的血案需要PerformanceMonitoring!_v_images/20191129173907.pngPerformanceMonitoring流量统计调用延迟异常报警!_v_images/20191129173916.png数据同步的细节问题问题一并发写静态一致性写隔离解决方案中心化锁机制进程间协商机制!_v_images/20191129173927.png分布式树形锁注意问题tryLock/release需要2次交互注册Lock的有效期等待Lock超时动态hash连接异常时退化!_v_images/20191129173936.png性能问题吞吐量下降每个app一个树形锁，单进程，终究有吞吐上限任何操作，包括没有冲突操作，都需要先获得锁主要性能的点单次pushsync量大，可以导致阻塞异步pushsync令人恶心的架构诞生了缩减了write操作的过程保证云端与客户端一致性太过复杂，不确定因素累加过多!_v_images/20191129174007.png", "技术架构/大型网站架构技术一览.md": "大型网站架构技术一览大型网站的挑战主要来自庞大的用户，高并发的访问和海量数据，任何简单的业务一旦需要处理数以P计的数据和面对数以亿计的用户，问题就会变得棘手。大型网站架构主要就是解决这类问题。更多内容也可以阅读各大互联网公司架构演进之路汇总、大型网站架构演化历程两篇文章。本文内容大部分来自《大型网站技术架构》,这本书很值得一看，强烈推荐。网站系统架构层次如下图所示：!_v_images/20191129175744.png1.前端架构前端指用户请求到达网站应用服务器之前经历的环节，通常不包含网站业务逻辑，不处理动态内容。浏览器优化技术并不是优化浏览器，而是通过优化响应页面，加快浏览器页面的加载和显示，常用的有页面缓存、合并HTTP减少请求次数、使用页面压缩等。CDN内容分发网络，部署在网络运营商机房，通过将静态页面内容分发到离用户最近最近的CDN服务器，使用户可以通过最短路径获取内容。动静分离，静态资源独立部署静态资源，如JS、CSS等文件部署在专门的服务器集群上，和Web应用动态内容服务分离，并使用专门的（二级）域名。图片服务图片不是指网站Logo、按钮图标等，这些文件属于上面提到的静态资源，应该和JS、CSS部署在一起。这里的图片指用户上传的图片，如产品图片、用户头像等，图片服务同样适用独立部署的图片服务器集群，并使用独立（二级）域名。反向代理部署在网站机房，在应用服务器、静态资源服务器、图片服务器之前，提供页面缓存服务。DNS域名服务，将域名解析成IP地址，利用DNS可以实现DNS负载均衡，配置CDN也需要修改DNS，使域名解析后指向CDN服务器。2.应用层架构应用层是处理网站主要业务逻辑的地方。开发框架网站业务是多变的，网站的大部分软件工程师都是在加班加点开发网站业务，一个好的开发框架至关重要。一个号的开发框架应该能够分离关注面，使美工、开发工程师可以各司其事，易于协作。同时还应该内置一些安全策略，防护Web用攻击。页面渲染将分别开发维护的动态内容和静态页面模板集成起来，组合成最终显示给用户的完整页面。负载均衡将多台应用服务器组成一个集群，通过负载均衡技术将用户请求分发到不同的服务器上，以应对大量用户同时访问时产生的高并发负载压力。Session管理为了实现高可用的应用服务器集群，应用服务器通常设计为无状态，不保存用户请求上下文信息，但是网站业务通常需要保持用户会话信息，需要专门的机制管理Session，使集群内甚至跨集群的应用服务器可以共享Session。动态页面静态化对于访问量特别大而更新又不很频繁的动态页面，可以将其静态化，即生成一个静态页面，利用静态页面的优化手段加速用户访问，如反向代理、CDN、浏览器缓存等。业务拆分将复杂而庞大的业务拆分开来，形成多个规模较小的产品，独立开发、部署、维护，除了降低系统耦合度，也便于数据库业务分库。按业务对关系数据库进行拆分，技术难度相对较小，而效果又相对较好。虚拟化服务器将一台物理服务器虚拟化成多态虚拟服务器，对于并发访问较低的业务，更容易用较少的资源构架高可用的应用服务器集群。3.服务层架构提供基础服务，供应用层调用，完成网站业务。分布式消息利用消息队列机制，实现业务和业务、业务和服务之间的异步消息发送及低耦合的业务关系。分布式服务提供高性能、低耦合、易复用、易管理的分布式服务，在网站实现面向服务架构（SOA）。分布式缓存通过可伸缩的服务器集群提供大规模热点数据的缓存服务，是网站性能优化的重要手段。分布式配置系统运行需要配置许多参数，如果这些参数需要修改，比如分布式缓存集群加入新的缓存服务器，需要修改应用程序客户端的缓存服务器列表配置，并重启应用程序服务器。分布式配置在系统运行期提供配置动态推送服务，将配置修改实时推送到应用系统，无需重启服务器。4.存储层架构提供数据、文件的持久化存储访问与管理服务。分布式文件网站在线业务需要存储的文件大部分都是图片、网页、视频等比较小的文件，但是这些文件的数量非常庞大，而且通常都在持续增加，需要伸缩性设计比较好的分布式文件系统。关系数据库大部分万丈的主要业务是基于关系数据库开发的，但是关系数据库对集群伸缩性的支持表较差。通过在应用程序的数据访问层增加数据库访问的路由功能，根据业务配置将数据库访问路由到不同的物理数据库上，可实现关系数据库的分布式访问。NoSQL数据库目前各种NoSQL数据库层出不穷，在内存管理、数据模型、集群分布式管理等方面各有优势，不过从社区活动性角度看，HBase无疑是目前最好的。数据同步在支持全球范围内数据共享的分布式数据库技术成熟之前，拥有多个数据中心的网站必须在多个数据中心之间进行数据同步，以保证每个数据中心都拥有完整的数据。在实践中，为了减轻数据库压力，将数据库的事物日志（或者NoSQL的写操作Log）同步到其他数据中心，根据Log进行数据重演，实现数据同步。5.后台架构网站应用中，除了要处理用户的实时访问请求外，还有一些后台非实时数据分析要处理。搜索引擎即使是网站内部的搜索引擎，也需要进行数据增量更新及全量更新、构建索引等。这些操作通过后台系统定时执行。数据仓库根据离线数据，提供数据分析与数据挖掘服务。推荐系统社交网站及购物网站通过挖掘人与人之间的关系，人和商品之间的关系，发展潜在的人际关系和购物兴趣，为用户提供个性化推荐服务。6.数据采集与监控监控网站访问情况与系统运行情况，为网站运营决策和运维管理提供支持保障。浏览器数据采集通过在网站页面中嵌入JS脚本采集用户浏览器环境与操作记录，分析用户行为。服务器业务数据采集服务器业务数据包括两种，一种是采集在服务器端记录的用户请求操作日志；一种是采集应用程序运行期业务数据，比如待处理消息数目等。服务器性能数据采集采集服务器性能数据，如系统负载、内存使用率、网卡流量等。系统监控将前述采集的数据以图表的方式展示，以便运营和运维人员监控网站运行状况，做到这一步仅仅是系统监视。更先进的做法是根据采集的数据进行自动化运维，自动处理系统异常状况，是吸纳自动化控制。系统报警如果采集来的数据超过预设的正常情况的阀值，比如系统负载过高，就通过邮件、短信、语音电话等方式发出警报信号，等待工程师干预。7.安全架构保护网站免遭攻击及敏感信息泄露。Web攻击以HTTP请求的方式发起的攻击，危害最大的就是XSS和SQL注入攻击。但是只要措施得当，这两种攻击都是比较容易防范的。数据保护敏感信息加密传输与存储，保护网站和用户资产。8.数据中心机房架构大型网站需要的服务器规模数以十万计，机房物理架构也需要关注。机房架构对于一个拥有十万台服务器的大型网站，每台服务器耗电（包括服务器本身耗电及空调耗电）每年大约需要人民币2000元，那么网站每年机房电费就需要两亿人民币。数据中心能耗问题日趋严重，Google、Facebook选择数据中心地理位置的时候趋向选择散热良好，供电充裕的地方。机柜架构包括机柜大小，网线布局、指示灯规格、不间断电源、电压规格（是48V直流电还是220V民用交流电）等一系列问题。服务器架构大型网站由于服务器采购规模庞大，大都采用定制服务器的方式代替购买服务器整机。根据网站应用需求，定制硬盘、内存、甚至CPU，同时去除不必要的外设接口（显示器输出接口，鼠标、键盘输入接口），并使空间结构利于散热。", "技术架构/插件容器文档.md": "1.插件容器原理1.1插件容器提供的功能容器主要提供统一的权限管理（认证、授权、鉴权）和插件管理功能。权限管理采用Shiro、redis在应用层来实现，抛弃了tomcat等web服务器提供的session管理功能。结构如下图：!_v_images/20191129170204.png统一认证认证功能是由容器提供，插件不提供认证功能。用户在容器中认证后，容器将已认证的jSessionId传送给插件，插件通过jSessionId从redis中获取用户的认证信息，即完成统一的认证过程。用户可以通过Shiro的提供的API来获取用户的认证信息，可以参考SecurityUtils.getSubject的用法。统一授权统一授权是指统一管理插件的资源，统一授予给用户。插件注册时，将自身的资源注册到容器中，容器统一管理所有插件的资源；管理员可以通过容器提供的权限管理功能，将这些资源分配给用户。统一鉴权判断用户是否具有资源的访问权限，即鉴权。统一鉴权是指在容器和插件中，采用统一的权限校验方式来判断用户是否可以访问某资源，插件无需为鉴权开发任何功能。用户通过认证后，将获取所拥有的插件资源访问权限，并将此权限信息缓存入redis数据库，而插件通过jSessionId从redis中获取用户的权限信息，完成权限校验。页面的鉴权是通过tag完成的，目前提供freemaker和jsp两套标签。鉴权标签是通过资源url来判断的，所以插件必须保证自身提供的资源url在所有插件资源中是唯一的。插件管理与监控插件管理提供插件注册、启用/停用、修改、删除等功能，而插件监控主要是监控插件的运行状况，当插件异常停止时，发出告警信息。1.2统一认证和授权的过程用户访问业务系统的认证及鉴权过程如下：!_v_images/20191129170238.png插件获取认证授权信息过程如下：!_v_images/20191129170246.png2.插件开发文档2.1插件注册插件注册到应用插件容器有两种方式：插件启动时注册容器容器提供的插件注册接口：url：xxx.xxx.xxx.xxx:port/{contextPath}/uaa/reg,参数：插件自解释JSON，参见下面的插件自解释接口返回值：{status:,message:}，status为0表示调用成功，1表示失败；message为返回信息插件启动后，在容器段手动添加插件提供自解释接口（接口返回内容参见下面插件自解释接口），在插件容器输入该自解释地址，手动添加插件**插件自解释接口**标准如下：```javascript{\"id\":\"pluginId\",\"name\":\"插件Demo\",\"uaaUrl\":\"192.168.0.209:8080/uaa/ck\",\"menuJson\":\"{'id':'pluginId','name':'插件2','pid':null,'description':null,'pageurl':null,'type':1,'state':'是','sort':null,'icon':null},{'id':'pluginId_list','name':'列表','pid':'pluginId','description':null,'pageurl':'/system/plugin/list','type':1,'state':'是','sort':null,'icon':null},{'id':'pluginId_update','name':'修改','pid':'pluginId','description':null,'pageurl':'/system/plugin/update','type':0,'state':'是','sort':null,'icon':null},{'id':'pluginId_delete','name':'删除','pid':'pluginId','description':null,'pageurl':'/system/plugin/delete','type':0,'state':'是','sort':null,'icon':null}\"}```插件自解释接口中的menuJson字段的值是一个JSON字符串，用来传递插件资源，是资源的列表。除menuJson之外的信息是插件自身的信息。2.2插件接收授权的URL地址插件必须实现一个接收认证授权信息的URL，该URL接收成功认证后的jSessionId。在用户登录时，这个URL链接将被客户端浏览器访问，插件将该jSessionId存入浏览器的Cookie中，这个cookie作为用户通过认证的唯一标识。浏览器拥有这个Cookie后，表明插件的权限管理被容器接管，插件资源已被容器授权控制。PS:这个URL需要填入到插件自解释接口的uaaUrl中。这个地址实现的功能是将jSessionId写入浏览器Cookie，此jSessionId是采用DES对称加密过的，实现参考：idbpuaashiro工程中UaaConsumer类writeCookie方法，如下：```javaStringCryptodes=newStringCrypto;jid=des.decryptjid;//针对IE，必须加P3P到header中，否则无法写入cookieresponse.addHeader\"P3P\",\"CP=\\\"CURaADMaDEVaPSAoPSDoOURBUSUNIPURINTDEMSTAPRECOMNAVOTCNOIDSPCOR\\\"\";Cookiecookie=newCookie\"SHAREJSESSIONID\",jid;cookie.setMaxAge1;//浏览器关闭此Cookie时效cookie.setPath\"/\";response.addCookiecookie;//加入Cookies```2.3ShiroRedis缓存配置ShiroRedis缓存配置有两种方式：基于Spring配置、基于INI配置。Spring配置参考：idbpplugin1的applicationContextshiroprod.xml文件INI配置参考：idbpplugin2jfinal的shiro.ini文件", "技术架构/日志审计系统.md": "tocblog.csdn.net/cheng_fangang/article/details/42418017blog.csdn.net/qq_38265137/article/details/106790419www.youxia.org/2015/01/13547.html日志审计系统简介什么是日志审计？综合日志审计平台，通过集中采集信息系统中的系统安全事件、用户访问记录、系统运行日志、系统运行状态等各类信息，经过规范化、过滤、归并和告警分析等处理后，以统一格式的日志形式进行集中存储和管理，结合丰富的日志统计汇总及关联分析功能，实现对信息系统日志的全面审计。通过日志审计系统，企业管理员随时了解整个IT系统的运行情况，及时发现系统异常事件；另一方面，通过事后分析和丰富的报表系统，管理员可以方便高效地对信息系统进行有针对性的安全审计。遇到特殊安全事件和系统故障，日志审计系统可以帮助管理员进行故障快速定位，并提供客观依据进行追查和恢复。为什么需要日志审计平台？1.日志审计的合规要求，由于网络安全法的颁布实施，由原先的不合规转变成了不合法。如果不对要求的相关日志不做留存6个月以上，一旦追查，将面临法律责任。2.安全运营的挑战。随着网络设备的增多，以及服务器数量的增多，如果没有统一的综合日志审计平台，那么需要登录到每台设备上查看日志，不利于运维人员管理。而且众多设备会产生海量的日志，无法有效管理。多种设备形成信息孤岛，日志无法关联分析。通过统一的日志审计平台，将所有设备日志都收集到日志平台进行统一管理，统一分析。日志审计的核心目标：多源数据归一化日志存储集中化关联分析自动化安全态势立体化需求背景但是随着信息安全系统的部署和发展，该银行的信息安全工作面临如下的需求：需要建设全面的日志采集需求：需要将接入网络、网站范围内的安全日志及主机系统日志，统一采取日志，集中管理分析。日志规范化需求：由于全网设备种类繁多，各设备日志信息存储格式、字段含义、通信协议差异较大。需要对采集到的各种设备日志进行归一化处理，提取审计记录完整信息，为后续审计分析提供依据。基于策略的日志过滤、归并：面对海量原始日志，需要按照相关策略进行过滤和归并，减轻日志数据传输压力和存储压力。关联分析及审计需求：对于来自各个资源的日志信息，提供多维的关联分析功能。面向系统用户，将一个用户在多个设备上的操作进行横向关联分析，形成以用户为主题的操作行为审计；面向特定安全事件，对于发生在多个设备上的事件痕迹进行关联分析，形成一个完整的事件相关操作过程的审计；从设备角度，形成本设备全部访问情况的安全审计报告。日志存储需求：原始日志信息是来自网络的第一手数据，需要长期存储，并确保它们的完整性、保密性，不得随意访问、修改和删除。同时，由于日志量较大，应提供压缩存储机制。通过实施告警标准化系统，可以达到对告警分级分类展现，提高工作效率的目的。因此，该银行用户希望通过建设一个日志审计平台，实现对各类安全日志进行集中管理并解决以上安全工作难题。日志审计的主要功能统一日志采集：对不同日志源主机系统、网络设备、安全设备、应用中间件、数据库等所产生的日志进行收集，实现日志的集中管理和存储。支持解析任意格式、任意来源的日志，通过解析规则标准化。使用无代理的方式收集日志。支持代理方式的日志收集。关联分析：预置多种事件关联规则。定位外部威胁、黑客攻击、内部违规操作，设备异常。简单灵活定义关联规则。实时告警：通过邮件、短信、声音对发生的告警进行及时通知，并可通过接口调用自动运行程序或脚本。通过告警策略定义，对各类风险和事件进行及时告警或预警，提升运维效率。日志取证分析：深入分析原始日志事件，快速定位问题的根本原因。生成取证报表，例如攻击威胁报表、Windows/Linux系统审计报表以及合规性审计报表等。监管合规：提供Windows审计、Linux审计、PCI、SOX、ISO27001等合规性报表。支持创建自定义合规性报表功能结构!图：日志审计系统产品功能结构_v_images/20200731161608676_3747.png日志的转发方式：日志转发一般可以通过：Syslog转发，Kafka转发，http转发。日志收集一般支持：Syslog、SNMP等日志协议。日志审计系统常见模块：日志事件获取模块：安全事件监控系统是实时掌握全网的安全威胁状况的重要手段之一。通过事件监控模块监控各个网络设备、主机系统等日志信息，以及安全产品的安全事件报警信息等，及时发现正在和已经发生的安全事件，通过响应模块采取措施，保证网络和业务系统的安全、可靠运行。资产管理模块：资产管理实现对网络安全管理平台所管辖的设备和系统对象的管理。它将其所辖IP设备资产信息按其重要程度分类登记入库，并为其他安全管理模块提供信息接口。规则库模块：规则库已支持主流网络设备、主机系统、数据库系统等，而且还应涵盖已经部署的安全系统，包括防火墙系统、防病毒系统等。并提供新日志格式适配功能，支持从安全运营中心平台接收新日志解析映射规则配置。用户可以根据该适配功能，对新日志格式进行自行适配。统计报表功能：具备强大的统计功能，可快速生成多种专业化的报表并支持自定义图表的设定集展示。权限管理模块：超级管理员可根据用户角色分配平台查看、操作各模块的权限，用户可以访问而且只能访问自己被授权的资源", "技术架构/明略大数据项目实践分享.md": "问题1.关系数据库到Hadoop的增量同步开源的方案Sqoop基于自增主键的增量同步要求主键自增，且主键丌会被更新基于最新更新时间戳的增量同步要求表中含有最后更新时间戳字段不足之处数据源丌一定都满足使用场景性能损失，每次重做数据数据丌一致，主键更新时导致数据丌一致我们的增强方案基于数据库操作日志的实时增量数据同步方案!_v_images/20191129172746.png优势数据秒级同步性能消耗低，目标数据无需重做数据一致性好，支持主键更新试用场景多，骋求源表有主键戒唯一索引问题2.数据权限需求简单粗暴83为每个权限需求新做数据89数据冗余89笨重丌灵活Hive权限管理+View83可能会有非常多的view需要行管理83可能成千上万的企业用户映射到Hive用户83丌能支撑复杂查询83缺乏统一的跨引擎的权限控制89诚拗Hive查询，限制丌了Impala和SparkSQL明略方案ACRE基于ApacheHadoop精确到cell级别的跨引擎的统一权限管理工具**业务能力**支持基于ACL和RBAC的混合授权模型可以限制开发人员支持Hive、Impala、Spark的统一授权管理支持行列（Cell）基本访问控制基于访问过滤的实现无需修改原数据库/表结构!_v_images/20191129172757.pngCell级别的跨引擎的统一权限管理ACRE原理权限模型行权限Where语句控制库、表、列权限语法树分析!_v_images/20191129172805.png问题3.百亿数据、百万用户的OLAP方案1：传统方案数据库分库把丌同商户分布到丌同的mysql数据库上前端做Proxy行路由问题大数据平台和Mysql之间的数据同步MysqlHA单个用户的数据量过大不易扩展运维成本方案2：基于Impala/SparkSQL等的方案问题商户数据存入一张表戒者多张表时没办法满足高并发按商户分表的话可能会建立非常多的表定制化的处理提高流程的复杂度方案3：明略方案基于Hbase支撑OLAP需求原始数据同步到Hbase构建数据表根据用户查询的各个维度，通过MapReduce行预构建查询索引索引的key为纬度的丌同组合索引的value中存入用户常用的各种metric计算结果**优势**百亿级的数据在秒级甚至亚秒级返回结果基于Hbase的实现轻松支撑高并发请求可视化配置、灵活定义的索引源自于Hadoop系统的超强扩展能力简单总结Hadoop平台面对的是异构多源的数据源，需要能够支持增量同步这些异构数据源的数据安全不权限是企业级客户永丌缺席的需求海量数据高并发的实时BI需求越来越多数据是基础，好的数据应用需要更丰富的数据关键字：数据中心方案、大数据、数据挖掘、Mining、Hadoop、Hive、Hbase、Sqoop、数据权限", "技术架构/权限管理模型.md": "1概述各行各业中企业的管理方式千差万别、且纷繁复杂，权限管理设计往往迷失在这种复杂的关系中。而由于企业所在行业和管理方式差别，导致不可能拥有一个统一的模型能满足所有企业的权限管理需求。处理企业特殊的复杂的行政管理关系、建立理想权限模型方式是以RBAC模型为基础，在其上面作一些扩展来实现。这种方式的难点是理清行政管理关系不容易，理不清则建立权限模型也会不合理。2基于RBAC权限模型这篇文章对RBAC权限模型描述的比较清楚：RBAC权限管理模型：基本模型及角色模型解析及举例www.woshipm.com/pd/440765.html。RBAC权限管理模型有四种，分别是RBAC0，RBAC1，RBAC2，RBAC3。它们的区别是RBAC1有继承关系，RBAC2对用户、角色和权限三者之间增加了一些限制，RBAC3=RBAC1+RBAC2。最常用的是RBAC0，其次是RBAC1。现实业务中除了有特殊的要求，否则最好前两种基础上进行扩展，例如：增加Group支持。2.1RBAC+Group!_v_images/20191129180141.png3RBAC与组织机构的结合RBAC是一个理想的模型，而企业的组织机构和管理方式各不相同，必须把RBAC模型和企业组织模型抽象融合在一起，才能适应企业业务需求。这篇文章对非矩阵型结构的企业的权限模型做了详细描述：统一权限管理与组织机构的结合（缩水版）blog.sina.com.cn/s/blog_6df370b70100u8zj.html>岗位的层次表明了不仅在某个组织下的岗位有层次，实际所有岗位组成一颗完整的岗位树，都是树状层次结构中的节点。这是由于每个岗位都有直接上级，也就是他汇报工作的对象。>给部门分配权限和给岗位分配权限是有区别的。由于用户必须隶属于岗位，而岗位隶属于部门，部门的权限用户是不能继承的，部门的权限用来影响岗位权限。部门内的岗位权限不可超出部门权限，并且部门权限可分为通用权限（部门内岗位可自动继承）和特定权限（必须分配到具体岗位）。这样也可以实现分级的权限管理，由总管理员给部门分配权限，然后各部门管理员给本部门岗位分配权限。类似的我们也可以给职务分配权限，职务的权限将自动被关联此职务的岗位获得。>在基于角色的权限模型中，我们给角色分配权限，给用户分配角色，而在组织模型中，我们也需要给组织和岗位分配权限，给用户分配岗位，对比可发现两个模型结合的关键就在岗位和角色的关系上。处理岗位和角色的关系有合并和映射两种方法。>由于大部分的角色就是基于实际的岗位或者职务生成的，因此可以将岗位和角色合而为一，用组织模型的岗位同时表示权限模型的角色概念，直接给岗位、组织、职务分配权限。!_v_images/20191129180202.png3.1Role映射到岗位还是职务？**问题：**如下图所示的组织结构，在流程引擎中配置一个同时适用于研发1、2部请假审批流程，流程需要研发部门经理审批，如果该审批人设置成某一个部门经理的Role（表示岗位），那么流程只能用于其中这个部门。而另一个部门必须再配置一个同样的流程。流程一样而不能复用，这是不合理的。!_v_images/20191129180213.png**解决办法**方法一、将参与者设置成职务，列出该职务对应的岗位负责人，让用户选择审批人。方法二、将参与者设置成职务，通过计算请假人所在部门，通过部门在程序中自动确定审批人。所以，是否可以采用如下设计（不一定合理）：一种更灵活方式是，将Role映射到职务，在控制资源、菜单分配权限时，完全满足需求。当涉及到数据权限时（如：研发1部只能看1部的数据），可以将职务结合人员、数据的所属部门来控制权限。3.2简单数据权限如何融入其中？**问题**：用户如何只查看本部门的数据？用户如何查看跨部门的数据？**方案**：所谓简单数据权限管理是满足各个部门人员只能操作本部门的数据，只有在授权的情况下才能操作其他部门的数据。资源权限的控制方式是给资源加上标识，将此标识分配给Role，然后将Role分配给User，实现权限控制。（resource>roleuser）简单的数据权限控制亦可以借鉴这种方式，为每一条数据加上标识（部门Id），将此标识分配给Role，从而实现数据资源控制；同时，由于此标识是部门Id，直接可以通过User的部门Id来判断是否有操作数据的权限。**待解决的问题**：除了数据权限外，如何控制有效期限、可用额度、适用品种等等。4需求分析4.1RBAC要解决的问题如何对一个部门的人员**批量授权**？如何管理多个系统的角色、如何授权、如何鉴权？如何解决同一Role的用户，具有相同的功能权限，但是他们的数据操作权限不同的问题？“经理”可以查看、审批“普通员工”的工作报告，而“普通员工”只能查看、编辑自己的工作报告。如何控制？人员部门调动、职称发生变化，其权限如何自动变化？如何分级授权？如何适应信息系统和用户数量增加、信息系统功能升级、公司组织变动及岗位调整、业务权限审核人员变动等情况？如何信息留痕：所有权限申请审批、设置、变更记录需要留痕，要做到可检查、可追踪？用户申请权限如何审批？如何实现角色权限配置、用户角色配置分离管理？可参考附件《基于RBAC的用户权限管理的设计与实现》4.2GM权限管理要解决的问题角色是按组织、职务方式来管理，还是按照系统来管理？系统间的角色有共用的吗？org+role=岗位？岗位能确定到人，Role是职务，不能确定到人。为用户分配角色的权限、业务功能权限是否需要分离？开发人员以plugin方式开发、以system方式发布。5多系统的统一权限管理多系统统一权限管理需要解决的问题：建立统一的组织机构、人员、用户的管理提供统一的多系统、多终端的单点登录入口提供统一的授权管理，即各系统不提供授权管理，有统一授权平台来授权提供统一的权限校验方式支持分级授权可参考附件：《医院信息系统分级授权管理机制的研究和设计》根据自己项目的经验，有两点建议吧：1、实时跨系统校验不是一个好的方案，最好在各业务子系统做授权信息的缓存，由统一权限中心往各业务系统推送权限信息，子系统通过统一权限中心服务提供的jar包来管理缓存以及进行访问认证。这样权限系统服务响应慢或者不可用，或者升级等不会影响下游子系统的稳定运行。6待解决的问题Saas架构的权限管理如何设计？针对金融等对安全要求很高行业的权限模型如何设计？参考RBAC权限管理模型：基本模型及角色模型解析及举例www.woshipm.com/pd/440765.html统一权限管理与组织机构的结合（缩水版）blog.sina.com.cn/s/blog_6df370b70100u8zj.html多站点整合―单点登录简单方案blog.csdn.net/u011529563/article/details/12648345", "技术架构\\03【FEBS研究】/开发教程.md": "toc项目目录结构www.kancloud.cn/mrbird/springcloud/1265031后端项目结构如下所示：├─febsapm微服务APM模块│├─febsadmin微服务监控中心│├─prometheusgrafanaprometheusgrafanaapm相关配置，docker文件│└─skywalkingelkskywalkingelk相关配置，docker文件├─febsauth微服务认证服务器├─febscloud整个项目的父模块│├─sqlSQL脚本│├─postmanpostman脚本│└─dockercompose项目相关dockercompose文件├─febscommon通用模块│├─febscommoncore系统核心依赖包│├─febscommondatasourcestarter系统数据库自动装配starter│├─febscommondoc文档模块的核心依赖包│├─febscommondocgatewaystarter网关聚合微服务子系统api文档自动装配starter│├─febscommondocstarter微服务子系统api文档自动装配starter│├─febscommonredisstarter系统Redis自动装配starter│└─febscommonsecuritystarter微服务子系统安全配置自动装配starter├─febsgateway微服务网关├─febsserver微服务子系统│├─ebsserversystem微服务子系统系统核心模块│├─febsservertest微服务子系统demo模块│├─febsservergenerator微服务子系统代码生成模块│└─febsserverjob微服务子系统任务调度模块└─febstxmanager微服务分布式事务控制器如何添加自己的子系统www.kancloud.cn/mrbird/springcloud/1647291为了规范，建议将微服务子系统添加到febsserver层级下。```xml<parent><groupId>cc.mrbird</groupId><artifactId>febsserver</artifactId><version>2.1RELEASE</version><relativePath>../pom.xml</relativePath></parent><dependencies><dependency><groupId>cc.mrbird</groupId><artifactId>febscommoncore</artifactId><version>${febscloud.version}</version></dependency></dependencies>``````yamlfebs:cloud:security:enable:truesecurity:oauth2:resource:id:${spring.application.name}userinfouri:${febsgateway}:8301/auth/user```如何控制权限www.kancloud.cn/mrbird/springcloud/1265033后端控制后端资源权限控制使用SpringCloudSecurity权限注解控制，比如下面这个资源只有拥有\"user:add\"权限的用户可以访问：```JAVA@PostMapping@PreAuthorize\"hasAnyAuthority'user:add'\"publicvoidaddUserUseruserthrowsFebsException{this.userService.createUseruser;}```前端控制```XML<buttonvhaspermission=\"'user:add'\">新增用户</button>```项目打包www.kancloud.cn/mrbird/springcloud/1268277mvnclean和mvnpackagePostMan测试第三方登录使用指南以GitHub登录为例数据权限数据权限通常是通过部门或者组织架构来绑定的，目前系统没有组织架构，只有部门数据，所以在FEBSCloud中，数据权限通过部门ID绑定。`@DataPermissionmethods={\"selectPage\"}`注解用于控制数据权限，含义是：DataPermissionTestMapper的selectPage方法开启数据权限。开启后，数据查询前系统会在原始查询SQL中拼接xx.dept_idinxxx语句：Feign的使用Feign用于一个微服务子系统调用另一个微服务子系统的接口，本质就是http请求。但是我们的微服务都是受保护的，没有合法的令牌是无法获取到数据的，并且Fein默认并不会帮我们传递令牌。获取当前用户信息febscommoncore包下的FebsUtil工具类中。`getCurrentUser`、`getCurrentUsername`、`getCurrentUserAuthority`、`getCurrentTokenValue`全局异常控制所谓的全局异常捕获指的是系统的最外层Controller层的异常捕获。febscommoncore包中的BaseExceptionHandler类中定义了系统中几种常见的异常处理开启系统API文档目前较为流行的自动api生成框架为swagger，不过UI界面并不怎么适合国人的使用习惯，FEBSCloud集成的是Knife4J，下面演示下如何开启微服务API文档生成。starter使用介绍`febscommonsecuritystarter``febscommondocstarter``febscommonredisstarter``febscommondatasourcestarter`分布式事务演示演示前，请确保已经启动了febstxmanager、febsauth、febsgateway、febsserversystem和febsservertest。演示5种获取令牌方式OAuth2协议规范了4种获取令牌的方式：授权码模式、密码模式、客户端模式和简化模式，具体可以参考tools.ietf.org/html/rfc6749section4.1。SpringCloudOAuth2在此基础上添加了刷新令牌方式。", "技术架构\\03【FEBS研究】/搭建教程.md": "1.第一章基础框架搭建www.kancloud.cn/mrbird/springcloud/1263687JDK1.8SpringBoot2.1.6.RELEASESpringCloudGreenwich.SR1SpringCloudOAuth2SpringCloudSecurity1.1.架构预览!系统架构图s2.ax1x.com/2019/08/31/mxMgW8.png=1024xFEBSRegister：微服务注册中心，用于统一控制各个微服务实例的注册与发现；FEBSGateway：微服务网关，统一处理外部请求，是客户端和众多微服务连接的桥梁；FEBSAuth：微服务认证服务器，用于令牌（Token）生成和令牌校验，是整个权限系统的核心所在；FEBSServerSystem：微服务提供者（资源服务器）A，对外提供系统模块的CRUD服务；FEBSServerTest：微服务提供者（资源服务器）B。1.2.搭建微服务注册中心www.kancloud.cn/mrbird/springcloud/1263688在这一节中，我们先使用Eureka构建微服务注册中心（Eureka服务端），因为Eureka较为简单，无须启动第三方服务，只需要引入相关依赖即可。1.3.搭建认证服务器www.kancloud.cn/mrbird/springcloud/1263689借助SpringCloudOAuth和SpringCloudSecurity搭建一个统一给微服务发放访问令牌的认证服务器febsauth。1.4.搭建微服务网关www.kancloud.cn/mrbird/springcloud/1263690在微服务的架构中，服务网关就是一个介于客户端与服务端之间的中间层。在这种情况下，客户端只需要跟服务网关交互，无需调用具体的微服务接口。这样的好处在于，客户端可以降低复杂性，无需关注具体是哪个微服务在提供服务。这一节我们将使用SpringCloudZuul搭建微服务网关febsgateway。1.5.搭建资源服务器www.kancloud.cn/mrbird/springcloud/14207202.架构完善这一章主要对上一节搭建的基础框架进行完善，解决微服务权限系统常见的问题。2.1.参数配置化www.kancloud.cn/mrbird/springcloud/1263694`springbootconfigurationprocessor````java@Data@SpringBootConfiguration@PropertySourcevalue={\"classpath:febsauth.properties\"}@ConfigurationPropertiesprefix=\"febs.auth\"publicclassFebsAuthProperties{privateFebsClientsPropertiesclients={};privateintaccessTokenValiditySeconds=60*60*24;privateintrefreshTokenValiditySeconds=60*60*24*7;}``````inifebs.auth.accessTokenValiditySeconds=86400febs.auth.refreshTokenValiditySeconds=604800febs.auth.clients0.client=febsfebs.auth.clients0.secret=123456febs.auth.clients0.grantType=password,authorization_code,refresh_tokenfebs.auth.clients0.scope=all```2.2.异常处理www.kancloud.cn/mrbird/springcloud/12636952.3.Feign的使用www.kancloud.cn/mrbird/springcloud/1263696微服务之间服务的调用可以借助SpringCloudFeign来完成，SpringCloudFeign内部整合了SpringCloudRibbon和SpringCloudHystrix，所以它具有客户端负载均衡和服务容错的功能。`springcloudstarteropenfeign````java@EnableFeignClients@SpringBootApplicationpublicclassFebsServerTestApplication{......``````java@FeignClientvalue=\"FEBSServerSystem\",contextId=\"helloServiceClient\",fallbackFactory=HelloServiceFallback.classpublicinterfaceIHelloService{@GetMapping\"hello\"Stringhello@RequestParam\"name\"Stringname;}```2.4.微服务防护www.kancloud.cn/mrbird/springcloud/1263697自定义Zuul过滤器解决这个问题的大致思路是：在网关转发请求前，请求头部加入网关信息，然后在处理请求的微服务模块里定义全局拦截器，校验请求头部的网关信息，这样就能避免客户端直接访问微服务了。在自定义Zuul过滤器前，我们先来简单了解下Zuul的核心过滤器。Zuul中默认定义了4种不同生命周期的过滤器类型。PRE：PRE过滤器用于将请求路径与配置的路由规则进行匹配，以找到需要转发的目标地址，并做一些前置加工，比如请求的校验等；ROUTING：ROUTING过滤器用于将外部请求转发到具体服务实例上去；POST：POST过滤器用于将微服务的响应信息返回到客户端，这个过程种可以对返回数据进行加工处理；ERROR：上述的过程发生异常后将调用ERROR过滤器。ERROR过滤器捕获到异常后需要将异常信息返回给客户端，所以最终还是会调用POST过滤器。2.5.跨域处理www.kancloud.cn/mrbird/springcloud/1263698```java@ConfigurationpublicclassFebsGateWayCorsConfigure{@BeanpublicCorsFiltercorsFilter{finalUrlBasedCorsConfigurationSourcesource=newUrlBasedCorsConfigurationSource;finalCorsConfigurationcorsConfiguration=newCorsConfiguration;//允许cookie跨域corsConfiguration.setAllowCredentialstrue;//请求头部允许携带任何内容corsConfiguration.addAllowedHeaderCorsConfiguration.ALL;//允许任何来源corsConfiguration.addAllowedOriginCorsConfiguration.ALL;//允许任何HTTP方法corsConfiguration.addAllowedMethodCorsConfiguration.ALL;source.registerCorsConfiguration\"/**\",corsConfiguration;returnnewCorsFiltersource;}}```3.完善登录流程3.1.表结构设计www.kancloud.cn/mrbird/springcloud/1263701!用户角色权限s2.ax1x.com/2019/08/13/mpOPpR.png3.2.完善登录www.kancloud.cn/mrbird/springcloud/1263702`mybatisplusbootstarter``dynamicdatasourcespringbootstarter`MyBatisPlus多数据源依赖`mysqlconnectorjava`3.3.整合图形验证码www.kancloud.cn/mrbird/springcloud/1263703SpringSecurity本质是一长串的过滤器链，处理用户名密码登录的过滤器为`UsernamePasswordAuthenticationFilter`，要集成图形验证码校验很简单，只需要在`UsernamePasswordAuthenticationFilter`过滤器前添加图形验证码校验过滤器即可。我们通常会把验证码存储在Redis中，并设置失效时间。SpringBoot2.0后推荐使用Lettuce来代替Jedis，Lettuce基于Netty异步，拥有更好的性能。生成图形验证码可以借助GitHub的一个开源项目`github.com/whvcse/EasyCaptcha`，其提供了较为丰富的验证码配置可供选择。在febsauth的pom里引入该依赖：<dependency><groupId>com.github.whvcse</groupId><artifactId>easycaptcha</artifactId><version>1.6.2</version></dependency>在前后端不分离的架构下，我们通过浏览器传输的jsessionid来和验证码图片一一对应，但前后的分离的模式下，客户端发送的请求并没有携带jsessionid（因为不再基于Session），所以我们需要客户端在发送获取验证码请求的时候，携带一个key（比如按一定算法生成的随机字符串，模拟jsessionid）来和验证码一一对应。于是我们在create里一开始就从请求中获取key值，然后根据验证码配置文件生成验证码，并将验证码字符保存到了Redis中（RedisKey为febs.captcha.+客户端上送的key值，有效时间为配置文件定义的120秒），并将验证码图片以流的形式返回给客户端。```java@ComponentpublicclassValidateCodeFilterextendsOncePerRequestFilter{@AutowiredprivateValidateCodeServicevalidateCodeService;@OverrideprotectedvoiddoFilterInternalHttpServletRequesthttpServletRequest,HttpServletResponsehttpServletResponse,FilterChainfilterChainthrowsServletException,IOException{//校验验证码```3.4.Sentinel验证码限流www.kancloud.cn/mrbird/springcloud/1263704因为我们的验证码服务是免认证的，所以只要知道了地址就可以频繁的去获取验证码，这无形之中给服务器增加了很大的压力，甚至可能导致服务器宕机。为了解决这个问题，我们可以在网关处整合阿里巴巴开源的Sentinel流量哨兵来限制验证码的获取频率。`com.alibaba.csp:sentinelzuuladapter:1.6.3````java@ConfigurationpublicclassFebsGatewaySentinelFilter{....@PostConstructpublicvoiddoInit{initGatewayRules;}/***定义验证码请求限流，限流规则：*60秒内同一个IP，同一个key最多访问10次*/privatevoidinitGatewayRules{Set<ApiDefinition>definitions=newHashSet<>;Set<ApiPredicateItem>predicateItems=newHashSet<>;predicateItems.addnewApiPathPredicateItem.setPattern\"/auth/captcha\";ApiDefinitiondefinition=newApiDefinition\"captcha\".setPredicateItemspredicateItems;definitions.adddefinition;GatewayApiDefinitionManager.loadApiDefinitionsdefinitions;Set<GatewayFlowRule>rules=newHashSet<>;rules.addnewGatewayFlowRule\"captcha\".setResourceModeSentinelGatewayConstants.RESOURCE_MODE_CUSTOM_API_NAME.setParamItemnewGatewayParamFlowItem.setParseStrategySentinelGatewayConstants.PARAM_PARSE_STRATEGY_URL_PARAM.setFieldName\"key\".setMatchStrategySentinelGatewayConstants.PARAM_MATCH_STRATEGY_EXACT.setParseStrategySentinelGatewayConstants.PARAM_PARSE_STRATEGY_CLIENT_IP.setCount10.setIntervalSec60;GatewayRuleManager.loadRulesrules;}}```4.整合Swagger4.1.完善febsserversystemwww.kancloud.cn/mrbird/springcloud/1263707因为febsserversystem模块负责用户管理、角色管理、菜单管理、部门管理等模块的增删改查，所以这章将演示如何在febsserversystem模块里集成swagger，其他微服务系统要集成swagger照猫画虎就行了。集成MyBatisPlus配置p6spyp6spy用于在控制台中打印MyBatis执行的SQL。用户管理模块增删改查暴露服务数据校验PostMan测试4.2.接入Swaggerwww.kancloud.cn/mrbird/springcloud/1263708`io.springfox:springfoxswagger2:2.9.2``io.springfox:springfoxswaggerui:2.9.2`4.3.SwaggerOAuth2认证www.kancloud.cn/mrbird/springcloud/1263709我们在febsauth模块里配置一个新的Client，专门用于Swagger令牌发放。在febsauth模块的febsauth.properties配置文件里添加如下配置:```inifebs.auth.clients1.client=swaggerfebs.auth.clients1.secret=123456febs.auth.clients1.grantType=passwordfebs.auth.clients1.scope=test```5.整合第三方服务5.1.整合SpringBootAdminwww.kancloud.cn/mrbird/springcloud/1263712SpringBootAdmin通过`springbootstarteractuator`提供的REST接口实现了图形化的监控界面，包括应用的配置信息、Beans信息、环境属性、线程信息、JVM状况等。SpringBootAdmin分为服务端和客户端。客户端通过HTTP向服务端提供自身信息，服务端收集这些信息并以图形化界面的方式呈现。下面，SpringBootAdmin客户端简称为SBA客户端，SpringBootAdmin服务端简称为SBA服务端。整合SpringBootAdmin后，我们的系统架构如下所示:!系统架构图s2.ax1x.com/2019/08/31/mxQHHA.png=1024x`de.codecentric:springbootadminserver:2.1.6``de.codecentric:springbootadminserverui:2.1.6`5.2.SleuthZipkin链路追踪www.kancloud.cn/mrbird/springcloud/1263713一个复杂的业务流程通常会被拆分多个微服务系统来完成，微服务间通过Feign来通信。当业务流程足够复杂时，一个完整的HTTP请求调用链一般会经过多个微服务系统，要通过日志来跟踪一整个调用链变得不再那么简单。我们可以通过SpringCloudSleuth来解决这个问题。整合SpringCloudSleuth`org.springframework.cloud:springcloudstartersleuth`从日志里捞取traceId并追踪请求链路。借助zipkin实现使用图形化界面的方式追踪请求链路。整合Zipkin在整合Zipkin之前，我们需要先搭建RabbitMQ。RabbitMQ用于收集Sleuth提供的追踪信息，然后ZipkinServer从RabbitMQ里获取，这样可以提升性能。5.3.logback日志打印www.kancloud.cn/mrbird/springcloud/12637145.4.ELK日志收集www.kancloud.cn/mrbird/springcloud/1263715搭建ELK环境修改微服务日志配置我们分别在febsauth、febsgateway和febsserver模块的pom里引入`Logstash`依赖`net.logstash.logback:logstashlogbackencoder:6.1`，并增加logbackspring.xml配置：```xml<!输出到logstash的appender><appendername=\"logstash\"class=\"net.logstash.logback.appender.LogstashTcpSocketAppender\"><destination>192.168.33.10:4560</destination><encodercharset=\"UTF8\"class=\"net.logstash.logback.encoder.LogstashEncoder\"/></appender><rootlevel=\"info\"><appenderrefref=\"logstash\"/></root>```6.前端系统介绍FEBSCloud的前端FEBSCloudWeb采用vueelementadmin，它是一款基于vue和elementui实现的后台管理系统模板。6.1.封装Axioswww.kancloud.cn/mrbird/springcloud/12637186.2.Vue导航守卫www.kancloud.cn/mrbird/springcloud/12637196.3.动态路由构建www.kancloud.cn/mrbird/springcloud/12637206.4.处理用户登录www.kancloud.cn/mrbird/springcloud/1263721!登录流程s2.ax1x.com/2019/08/28/mHF6WF.png6.5.处理令牌刷新www.kancloud.cn/mrbird/springcloud/1263722我们在febsauth定义的令牌有效时间为86400秒（即24小时），过了24小时候令牌就失效了。假如令牌即将要失效时，用户还在使用系统，那么用户的某个操作可能进行了一半时，系统突然弹出登录过期提示，非常影响用户体验。要解决上面的问题，我们可以在令牌将要失效时，判断用户是否还在使用系统，如果是的话，我们可以偷偷地通过刷新令牌来获取一个新的访问令牌，存储到浏览器内存中。这样就可以在用户无感知的情况下，“延长”访问令牌的有效时间。因为我们系统的请求都是通过6.1节封装的Axios对象来完成的，并且我们在request.js里配置了请求拦截，所以我们刷新令牌的动作也可以在请求拦截器里完成，大致步骤如下图所示：!处理令牌刷新s2.ax1x.com/2019/08/28/mH8sDP.png6.6.自定义Vue权限指令www.kancloud.cn/mrbird/springcloud/1263723`<buttonvhaspermission=\"'user:add'\">新增用户</button>`7.微服务部署7.1.微服务Docker化www.kancloud.cn/mrbird/springcloud/12637267.2.使用DockerCompose部署www.kancloud.cn/mrbird/springcloud/12637278.微服务进阶8.1.令牌存储策略www.kancloud.cn/mrbird/springcloud/1277531RedisTokenStore在第一章搭建认证服务器的时候，我们使用的是RedisTokenStore令牌存储策略。使用这种策略时，用户的access_token将存储到Redis中，退出登录后，Redis中存储的令牌也会被清除。除了这种令牌存储策略外，Spring还提供了InMemoryTokenStore、JdbcTokenStore和JwtTokenStore三种存储策略：InMemoryTokenStore该策略将令牌存储到内存中，优点就是无需依赖第三方存储，对于开发小型服务是不错的选择；缺点是认证服务器故障重启后，之前存储的令牌就丢失。JdbcTokenStore顾名思义，该策略使用数据库来存储令牌。在使用这种策略之前，我们需要先准备好库表。SpringSecurityOAuth仓库可以找到相应的脚本，只需要使用到oauth_access_token和oauth_refresh_token数据表。JwtTokenStore前面三种存储策略生成的令牌都是使用UUID生成的无意义字符串，我们也可以使用JwtTokenStore生成JWT格式令牌。在febsauth模块下认证服务器配置类FebsAuthorizationServerConfigure中配置JwtTokenStore。8.2.使用CloudGateway搭建网关www.kancloud.cn/mrbird/springcloud/1263731这一节，我们将使用SpringCloudGateway构建一个全新的微服务网关，代替之前通过SpringCloudZuul构建的微服务网关。和Zuul相比，SpringCloudGateway具有如下优势：基于Reactor模型的WebFlux构建，运行在Netty上，具有更好的性能；可拓展性高，内置了非常丰富的转发规则，除此之外，我们也可以定义自己的转发规则。对于WebFlux不熟悉的同学可以在学完本节后阅读我的博文：mrbird.cc/tags/WebFlux/。`org.springframework.cloud:springcloudstartergateway`转发规则SpringCloudGateway两大核心概念为：谓词工厂和过滤器工厂，谓词工厂用于定义转发规则，过滤器工厂用于修改请求和响应。SpringCloudGateway内置的谓词工厂和过滤器工厂可以参考：cloud.spring.io/springcloudgateway/reference/html/gatewayrequestpredicatesfactories和cloud.spring.io/springcloudgateway/reference/html/gatewayfilterfactories。```ymlspring:cloud:gateway:routes:id:FEBSAuthuri:lb://FEBSAuthpredicates:Path=/auth/**filters:StripPrefix=1id:FEBSServerSystemuri:lb://FEBSServerSystempredicates:Path=/system/**filters:StripPrefix=1id:FEBSServertesturi:lb://FEBSServerTestpredicates:Path=/test/**filters:StripPrefix=1```定义全局过滤器8.3.使用AlibabaNacos注册中心www.kancloud.cn/mrbird/springcloud/12711338.4.使用AlibabaNacos存储配置www.kancloud.cn/mrbird/springcloud/1289434SpringCloudAlibabaNacos不但可以用于搭建微服务注册中心，还可以统一管理微服务配置，类似于SpringCloudConfig。Nacos数据持久化Nacos支持使用MySQL进行数据持久化。使用Nacos管理配置增加依赖`org.springframework.cloud:springcloudstarteralibabanacosconfig````ymlspring:application:name:FEBSAuthcloud:nacos:discovery:serveraddr:${nacos.url}:8001config:serveraddr:${nacos.url}:8001group:DEFAULT_GROUPprefix:febsauthfileextension:yaml```8.5.接入Prometheus+Grafana这节的目的是搭建一个多维度监控微服务的可视化平台，包括Docker容器监控、MySQL监控、Redis监控和微服务JVM监控等，并且在必要的情况下可以发送预警邮件。这节主要用到的组件有Prometheus、Grafana、alertmanager、node_exporter、mysql_exporter、redis_exporter、cadvisor。各自作用如下所示：1.Prometheus：获取、存储监控数据，供第三方查询；2.Grafana：提供Web页面，从Prometheus获取监控数据可视化展示；3.alertmanager：定义预警规则，发送预警信息；4.node_exporter：收集微服务端点监控数据；5.mysql_exporter：收集MySQL数据库监控数据；6.redis_exporter：收集Redis监控数据；7.cadvisor：收集Docker容器监控数据。8.6.整合skywalking分布式追踪www.kancloud.cn/mrbird/springcloud/1337996Skywalking是由国人吴晟开发的一款分布式追踪软件，后面成功孵化为Apache的顶级项目。Skywalking主要包括了分布式追踪、性能指标分析、应用和服务依赖分析等功能，使用体验后个人感觉比zipkin更为直观，是替代zipkin的一个不错的选择。Skywalking的主要结构图如下所示:!s2.ax1x.com/2019/10/20/Kutat0.png=1024x从上图可以看出Skywalking主要分为四个模块：agent、collector、webappui和storage。我们可以使用Skywalkingagent探针无侵入地接入SpringCloud应用，然后通过HTTP或者GRPC将应用数据采集到collector收集器。collector中的数据存储与storage，支持MySQL、H2、Elasticsearch等存储，最终这些数据集中在webappui以图形化的方式呈现。8.7.升级到Hoxton.RELEASEwww.kancloud.cn/mrbird/springcloud/14117359.K8S集群部署9.1.集群环境准备www.kancloud.cn/mrbird/springcloud/1426915这一章节，我们的目标是通过Kubernetes（下面简称k8s，因为k和s之间有8个字符，所以俗称k8s）部署一个高可用的FEBSCloud微服务权限系统，所以在此之前你需要掌握Kubernetes的基本知识。如果您还未曾接触过Kubernetes，可以通过我的博客mrbird.cc/tags/Kubernetes/或者购买《Kubernetes权威指南第4版》书籍学习。9.2.安装第三方服务www.kancloud.cn/mrbird/springcloud/1426916这一节我们需要安装的内容较多，包括Docker、DockerCompose、MySQL、Redis、ELK等软件。9.3.Kubeadm搭建K8S1.16.2集群www.kancloud.cn/mrbird/springcloud/1426917Kubernetes从1.4版本开始后就引入了kubeadm用于简化集群搭建的过程，在Kubernetes1.13版本中，kubeadm工具进入GA阶段，可用于生产环境Kubernetes集群搭建。本节将使用Kubeadm搭建Kubernetes1.16.2集群，宿主机使用9.1里搭建的master、node1、node2、node3四台虚拟机，即一主三从的K8S集群结构。9.4.NFS服务器搭建www.kancloud.cn/mrbird/springcloud/1426918在K8S中，我们虽然可以使用volume将容器内目录挂载到宿主机目录上，但由于Pod调度的不确定性，这种数据存储方式是不牢靠的。对于有状态的应用，我们希望无论Pod被调度到哪个节点上，它们的数据总能够完整地恢复，这时候我们就不能用volume挂载了，而应该使用“网络共享存储”。9.5.搭建Docker镜像仓库Harborwww.kancloud.cn/mrbird/springcloud/1426919在本地环境下（或者公司局域网），将Docker镜像推送到DockerHub速度比较慢，推荐的做法是安装一个第三方的Docker镜像仓库，这里推荐使用Harbor。Harbor是一款开源的Docker镜像存储仓库，其扩展了DockerDistribution，在此基础上添加了我们常用的功能，比如安全认证，RBAC用户权限管理，可视化页面操作等功能。9.6.K8S构建高可用Nacoswww.kancloud.cn/mrbird/springcloud/14269209.7.K8S构建FEBSCloud服务集群www.kancloud.cn/mrbird/springcloud/14269219.8.部署前端测试www.kancloud.cn/mrbird/springcloud/142692210.分布式事务研究10.1.分布式架构事务挑战www.kancloud.cn/mrbird/springcloud/145614310.2.分布式事务解决方案www.kancloud.cn/mrbird/springcloud/145614410.3.基于消息中间件RocketMQ方案（一）www.kancloud.cn/mrbird/springcloud/145614510.4.基于消息中间件RocketMQ方案（二）www.kancloud.cn/mrbird/springcloud/145614610.5.基于TXLCN方案www.kancloud.cn/mrbird/springcloud/145614710.6.基于阿里Seata方案10.6.www.kancloud.cn/mrbird/springcloud/1456148搭建SeataServerSeata是一款开源的分布式事务解决方案，致力于提供高性能和简单易用的分布式事务服务。Seata将为用户提供了AT、TCC、SAGA（适合业务流程长、业务流程多的情况，所以本节不演示）和XA（截至2020年1月1日，该功能Seata还在开发中，所以也不演示）事务模式，为用户打造一站式的分布式解决方案。", "技术架构\\04【架构师大型项目实战】/001-集群基础概念.md": "TOC001集群基础概念网络请求!_v_images/20200604160036617_29204.png问题：什么是Prefork请求？Apache工作的三种模式：Prefork、Worker、Eventblog.mimvp.com/article/27778.html网络请求，内核进程空间，用户进程空间，网卡，磁盘IO？Linux内核空间与用户空间www.cnblogs.com/sparkdev/p/8410350.htmlLinux网络IO和磁盘IO详解www.cnblogs.com/sunsky303/p/8962628.htmlDNS负载均衡!_v_images/20200604155954082_1565.pnglinux运维学习笔记：集群系列之01：linux集群基础概念www.jianshu.com/p/a9b2d5b32a3a如何分配调度多台主机?>DNS负载均衡技术的实现原理是在DNS服务器中为同一个主机名配置多个IP地址，在应答DNS查询时，DNS服务器对每个查询将以DNS文件中主机记录的IP地址按顺序返回不同的解析结果，将客户端的访问引导到不同的机器上去，使得不同的客户端访问不同的服务器，从而达到负载均衡的目的。>大多数域名注册商都支持对统一主机添加多条A记录，这就是DNS轮询，DNS服务器将解析请求按照A记录的顺序，随机分配到不同的IP上，这样就完成了简单的负载均衡。什么是域名的A记录？域名的A记录、mx记录、ns记录怎么查看wenku.baidu.com/view/671df0c55fbfc77da269b1f0.htmlDNS负载均衡有什么缺点？1.每台主机都必须有独立外网IP2.由于使用了DNS缓存，新的DNS记录生效需要几个小时。一旦发生宕机，不能及时生效。3.本地DNS服务器会缓存已解析的域名到IP地址的映射，这会导致使用该DNS服务器的用户在一段时间内访问的是同一台Web服务器，导致Web服务器间的负载不均匀。负载均衡手段之DNS轮询www.cnblogs.com/data2value/p/6107380.html如何解决DNS负载均衡的缺点（服务器性能差异，负载不均匀，DNS缓存）？>RoundRobin:轮调：同一个客户端请求，并发的资源可能来自多台服务器。WRR:weightRoundRobin加权轮调：解决服务器的硬件、性能有所差异。考虑公平以及效率，权重weight。能者多劳。LB集群!_v_images/20200604161328677_28397.pngLinux负载均衡LVS原理技术详细讲解blog.csdn.net/chen_fly2011/article/details/54912326LVS负载均衡（LVS简介、三种工作模式、十种调度算法）blog.csdn.net/weixin_40470303/article/details/80541639MySQL数据过载怎么办？附件：从多台主机上传附件，怎么存储？NFSnfs文件共享服务器应用实战（一）blog.csdn.net/Lu_tixia/article/details/99571376nfs文件共享服务器应用实战（二）自动挂载技术blog.csdn.net/Lu_tixia/article/details/99628052nfs文件共享服务器企业实战（三）nfs高可用blog.csdn.net/Lu_tixia/article/details/99675199NFS共享存储实战www.cnblogs.com/gongjingyun123/p/11323968.html静态文件如何同步更新？rsync+inotifyinotify+rsync实现实时同步cloud.tencent.com/developer/article/1008061ftp的被动与主动模式是什么？FTP的主动模式和被动模式工作原理及抓包分析blog.csdn.net/jingzi123456789/article/details/83409572调度器过载怎么办？功能切分，比如：新浪子域名调度器宕机怎么办？Master,Slave。备用调度器如何知道主调度器宕机？心跳>standy:具备和primary配置一样，IP地址进行切换，自己服务启动。primary和standby时刻通信，发送heartbeat（心跳数）,一旦宕机，立即启动，进行切换。调度器如何知道主机是否宕机？健康检查>负载均衡可以定期向后端服务器发送Ping、尝试连接或发送请求来探测后端服务器运行的状况，这些探测称为健康检查。负载均衡通过健康检查来判断后端服务的可用性，避免后端服务异常影响前端业务，从而提高业务整体可用性。负载均衡原理与实践详解第六篇健康检查机制详解（上）blog.csdn.net/yiyuwu7069/article/details/78217985LBvsHA：处理能力vs可用性!_v_images/20200604165107019_13072.pngLB集群与HA集群的区别？>负载均衡集群着重在于提供服务并发处理能力的集群，高可用集群以提升服务在线的能力的集群。高性能集群着重用于处理一个海量任务。>LB集群具有高可用的能力，但不是高可用集群。HA集群的主机之间要进行通信，发送heartbeat，以及宕机后，快速切换服务。而LB集群的高可用能力是通过上面的调度服务器调度来实现。LBLoadBalancing集群、HAHighAvailability集群、HPHighPerformance集群blog.csdn.net/shuaishenkkk/article/details/22744979HA99%是99.9%的几倍？10倍>可用性=正常在线时间/正常在线时间+故障处理时间HA集群!_v_images/20200604164420210_17720.png在HA集群中要考虑哪些资源？>web服务器：primary：IP，webapp,页面standby：IP,webapp,页面在高可用集群中，如何充分利用standby主机资源？>web主机与mail主机互为standby。某一时刻某个资源只能被某个节点所占用。主机宕机，采用哪个standby？>定义优先级，由协调员DC来决定选择谁。主机如何通知standby自己还活着？>及时发送heartbeat，多播/组播，不能采用广播。存储!_v_images/20200604165927268_23242.pngNFS与硬盘读写文件的区别？>硬盘是块级别读取，NFS是文件级别读写。对于NFS与硬盘，两个程序同时写一个文件区别？>硬盘：无锁，错乱。NFS：有锁linux高可用集群HA原理详解www.cnblogs.com/insaneMrLi/p/10841166.htmlLB/HA高可用系列文章www.cnblogs.com/kevingrace/category/899066.html脑裂!_v_images/20200604171648321_1417.pngHA高可用集群中\"脑裂\"问题解决www.cnblogs.com/kevingrace/p/7205846.htmlDASSCSI、RAIDUltraSCSI320MbpsSAS6GbpsDASvs1000mbps/8>NAS的传输远比不上DASRAID与NFS>NFS对前端服务器而言，就是文件共享服务器。数据请求是在文件级别上完成的。RAID,是磁盘阵列，是通过主板上的总线连接到RAID上，相当于本地存储设备，数据是在块级别上交换的。当standby发现主机宕机，如何无错抢占DAS设备？DAS如何解决splitbrain脑裂问题？>由于没有及时传递heartbear信息，切换到备用的调度服务器，而主调度服务器还在写数据到DAS中，而standby也同时写同一个文件。左右就不协调了，称为splitbrain:脑裂。>解决办法：（1）电源交换机（切断主机的电源），爆头STONITHShootTheOtherNodeInTheHead（2）fencing（隔离）：拒绝某一节点访问某一资源的机制，使服务器和存储设备断开。隔离级别：1.节点级别：STONTIN。2.资源级别。当standby误以为主机宕机，抢占DAS，主机如何再抢回来？!_v_images/20200604172019789_32378.png>注意：为了防止脑裂,集群分裂，高可用集群至少有3个节点，奇数个节点，仲裁机制，少数服从多数。>补充：脑裂：本来一个大脑的两半球互相配合，变成了分裂成两个独立的大脑，都认为对方已死。在集群环境中，有这么几种可能造成\"SplitBrain\"现象：1、在集群环境中的节点间的心跳线同时断掉后，集群系统所处于的一种特殊状态。例如节点1和2组成一个集群，突然1和2间的心跳同时都断了，如果此前节点1正在运行应用，心跳都断掉后2开始去接管应用，强行加载数据，此时就是splitbrain。2、集群中节点因为处理器忙或者其他原因暂时停止响应时，其他节点可能误认为该节点“已死”。后果：节点间争夺共享磁盘（即资源）的访问权，都对共享文件系统产生读写操作，从而导致共享磁盘文件系统损坏。解决办法：使用硬盘心跳，scsireservation，以及最极端的powerfence。HP:高性能集群（HBC）!_v_images/20200604173501479_19275.png并行计算集群两个基础是什么？分布式文件系统将大大任务切割为是小任务，分别进行处理的机制。并行计算集群原理？>化整为零>合并整合。MapReduce>每台计算机只处理所有数据的一部分，且每台计算机上只存储一部分数据。每个节点既是计算节点，也是存储节点。!_v_images/20200604173728015_5214.png并行计算集群的主机兼具存储和计算，调度计算。", "技术架构\\04【架构师大型项目实战】/目录.md": "架构师大型项目实战第七套：Mysql主从复制+高可用集群+Linux+Nginx+Java+Memcached+Lvs+Redis实战PB级大型分布式大数据高并发架构实战案例网站性能调优001集群基础概念.md第七套/001集群基础概念.md", "技术架构\\25【诸葛SpringCloudAlibaba入门】/诸葛SpringCloudAlibaba入门.md": "TOC微服务架构github.com/alibaba/springcloudalibaba/blob/master/READMEzh.md!亿级流量电商网络微服务架构_v_images/20200917161031675_7588.png=1024xNacos注册中心!基于Nginx的负载均衡_v_images/20200917161526033_6220.png增加减少机器需要频繁修改配置!Nacos服务注册中心_v_images/20200917162815662_2365.png基于Ribbon算法的负载均衡!完整的微服务架构_v_images/20200917164823949_25307.png=1200xFeign：通过动态代理，实现对远程服务的调用。P6Sentinel限流熔断降级Sentinel切入点，从流量控制、熔断降级、系统负载保护等多个维度保护服务的稳定性。Sentinel教程Sentinel介绍QuickStartgithub.com/alibaba/Sentinel/wiki/介绍【Sentinel（一）】Sentinel介绍与使用blog.csdn.net/noaman_wgs/article/details/103328793%0Ablog.csdn.net/noaman_wgs/article/details/103328793Sentinel实战控制台篇www.jianshu.com/p/c47dfd25eeee%0Awww.jianshu.com/p/c47dfd25eeeeSentinel教程gitee.com/all_4_you/sentineltutorial%0Agitee.com/all_4_you/sentineltutorialgithub.com/alibaba/Sentinel/tree/master/sentineldemo!Sentinel主要特性imgblog.csdnimg.cn/20191130203727708.png?xossprocess=image/watermark,type_ZmFuZ3poZW5naGVpdGk,shadow_10,text_aHR0cHM6Ly9ibG9nLmNzZG4ubmV0L25vYW1hbl93Z3M=,size_16,color_FFFFFF,t_70=800xSentinel与Hystrix的区别关于Sentinel与Hystrix的区别见：技术选型：SentinelvsHystrixyq.aliyun.com/articles/633786/总体来说：Hystrix常用的线程池隔离会造成线程上下切换的overhead比较大；Hystrix使用的信号量隔离对某个资源调用的并发数进行控制，效果不错，但是无法对慢调用进行自动降级；Sentinel通过并发线程数的流量控制提供信号量隔离的功能；此外，Sentinel支持的熔断降级维度更多，可对多种指标进行流控、熔断，且提供了实时监控和控制面板，功能更为强大。SpringCloudAlibaba：Sentinel实现熔断与限流SpringCloudAlibaba：Sentinel实现熔断与限流juejin.im/post/6844903999876022279%0Ajuejin.im/post/6844903999876022279与Feign结合使用引入依赖`springcloudstarteralibabasentinel`在application.yml中打开Sentinel对Feign的支持：`feign.sentinel.enabled:true`在应用启动类上添加@EnableFeignClients启动Feign的功能；定义对nacosuserservice服务的调用```java@FeignClientvalue=\"nacosuserservice\",fallback=UserFallbackService.classpublicinterfaceUserService{@PostMapping\"/user/create\"CommonResultcreate@RequestBodyUseruser;}```创建UserFallbackService类实现UserService接口，用于处理服务降级逻辑：```java@ComponentpublicclassUserFallbackServiceimplementsUserService{@OverridepublicCommonResultcreateUseruser{UserdefaultUser=newUser1L,\"defaultUser\",\"123456\";returnnewCommonResult<>defaultUser,\"服务降级返回\",200;}}```通过Feign调用nacosuserservice服务中的接口：```java@RestController@RequestMapping\"/user\"publicclassUserFeignController{@AutowiredprivateUserServiceuserService;@PostMapping\"/create\"publicCommonResultcreate@RequestBodyUseruser{returnuserService.createuser;}```调用如下接口会发生服务降级，返回服务降级处理信息：localhost:8401/user/4```json{\"data\":{\"id\":1,\"username\":\"defaultUser\",\"password\":\"123456\"},\"message\":\"服务降级返回\",\"code\":200}``````java@TransactionalpublicStringcreateOrderLongproductId，LonguserId，IntegerstockCount，IntegercreditCount{System.out.println\"创建订单成功\";//T0D0stockService.deductStockproductId，stockCount;creditService.addCredituserId，creditCount;//DEBUG:停掉积分系统，不能报错wmsService.deliveryuserId，productId;return\"success\";}```Seata分布式事务seata.io/zhcn/@GlobalTransactionalSeataAT模式整体机制：两阶段提交协议的演变：一阶段：业务数据和回滚日志记录在同一个本地事务中提交，释放本地锁和连接资源。二阶段：提交异步化，非常快速地完成。回滚通过一阶段的回滚日志进行反向补偿。对数据一致性的及时性要求不高的业务场景，尽量不适用分布式事务，因为Seata底层是加锁，降低了系统性能。电商业务中台整体微服务架构www.processon.com/view/link/5e69e768e4b07fc7a6841488!电商业务中台整体微服务架构_v_images/20200917182324982_14617.png=1200xGateway的作用SpringCloudGateway：路由（服务转发）限流安全认证（对请求统一校验权限）!Gateway配置_v_images/20200917174512999_3323.png分布式调用链路追踪Pinpoint微服务自动化监控Prometheus&Grafana", "社科/01《搞定 Ⅰ：无压工作的艺术》.md": "《搞定Ⅰ：无压工作的艺术》GTD心法（GettingThingsDone）书评book.douban.com/review/1930909/GTD原则>第一，清空你大脑的内存。把所有要做的事情分门别类，另外存放在一个逻辑性强而又可靠的系统中去。大脑是用来思考的，不是用来记事的。我们的大脑每天耗费太多时间提醒我们该做又没做的事情，应该把大脑从这种思维中解放出来。>第二，把任何任务和项目具体成actions。树立“nextactions”的观念。不管是什么任务项目，我们要问的问题是下一个动作是什么？只有这样才能把计划具体化，才能让我们随时把握该做什么。这样一来，在一个给定时间具体采取一个给定行动（action）的时候，我们才能做出最好的选择，而且对自己的行动选择有信心。一些概念Projects、项目清单**Projects**：任何一个需要多个步骤才能完成的任务。包括：目标、愿景、长期需要关注的事。将这些目标放入一个**项目清单**，提醒自己不忘目标、不要迷失，目标尚未达成。NextActions**NextActions**是日常需要处理的待办事项。日程表Calendar只记录需要提醒性质的任务，其他的一概免谈！包括三类：指定准确时间的行动；如：会议。指定日期范围的行动；如：周末给老娘打电话。指定日期得到信息。无需付诸行动的事务垃圾Trash：没有价值的事项统统扔掉。**孵化系统Incubation**：鸡肋事项，将来也许会做，备忘记录，Review时权衡是否要做。参考资料：不需要行动的重要信息，归档保存。检查事项对于委托给他人完成的事项，需要经常检查完成情况，并给与指导。处理过程Collect收集>Process整理>Do执行>Review回顾!工作流程图_v_images/20210903105944621_19997.png=600x基于QQ邮箱的GTD在【我的文件夹】建以下四个文件夹：`大目标`：作为项目清单，记录Projects。`CheckList`：记录需要委托的事项、需要经常检查。`归档`：存在重要参考资料。`鸡肋`：孵化系统，记录可做可不做的事项。将收集的事项以邮件形式发给自己，进入【收件箱】。不需要处理的事项，可彻底删除。已完成的事项，删除，邮件会保留一段时间。将不需要立即处理事项归于上面四个文件夹中。NextActions：【星级邮件】，给马上要处理的事项加上星，【星级邮件】即是当下要处理的事项。可以给邮件加上标签进行分类。可以时多维度的，比如Home、Office、Study、Work。日历：Calendar日程表，记录需要提醒的任务事项，到指定时间，会发邮件提醒。", "社科/《游戏改变世界》.md": "!_v_images/20191118221753.png本书的两个感悟点游戏的四大特征目标、规则、反馈系统、自愿参与这让我想到，怎样提供工作和学习的效果，并且自愿参与，不觉厌烦。我为了儿子制作了周任务卡，没有设定主任务（相当于老王或boss），设定每天可能任务（一般任务），供孩子选择，每完成一项任务，按照规则加分，获得荣誉加分（游戏中的奖励），各种犯规要扣分（被小怪给打了）。在工作中，制定目标一定要可度量，所以类似燃尽图很重要，可以看任务进展，实时反馈。游戏与社交微信仅只是聊天，就能汇集那么多人。游戏的诱惑比聊天大得多，可以想象用游戏把你的亲朋好友联系在一起。你可以远方的父母一起玩麻将、斗地主，你们可以比积分，是多么美妙。但是目前还没有这样的游戏。"}